GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: CLC1SEL2
#define CLC1SEL2 CLC1SEL2
CLC1SEL2                                 equ 0E2Bh
// bitfield definitions
CLC1SEL2_D3S_POSN                        equ 0000h
CLC1SEL2_D3S_POSITION                    equ 0000h
CLC1SEL2_D3S_SIZE                        equ 0008h
CLC1SEL2_D3S_LENGTH                      equ 0008h
CLC1SEL2_D3S_MASK                        equ 00FFh
CLC1SEL2_LC1D3S_POSN                     equ 0000h
CLC1SEL2_LC1D3S_POSITION                 equ 0000h
CLC1SEL2_LC1D3S_SIZE                     equ 0008h
CLC1SEL2_LC1D3S_LENGTH                   equ 0008h
CLC1SEL2_LC1D3S_MASK                     equ 00FFh
CLC1SEL2_D3S0_POSN                       equ 0000h
CLC1SEL2_D3S0_POSITION                   equ 0000h
CLC1SEL2_D3S0_SIZE                       equ 0001h
CLC1SEL2_D3S0_LENGTH                     equ 0001h
CLC1SEL2_D3S0_MASK                       equ 0001h
CLC1SEL2_D3S1_POSN                       equ 0001h
CLC1SEL2_D3S1_POSITION                   equ 0001h
CLC1SEL2_D3S1_SIZE                       equ 0001h
CLC1SEL2_D3S1_LENGTH                     equ 0001h
CLC1SEL2_D3S1_MASK                       equ 0002h
CLC1SEL2_D3S2_POSN                       equ 0002h
CLC1SEL2_D3S2_POSITION                   equ 0002h
CLC1SEL2_D3S2_SIZE                       equ 0001h
CLC1SEL2_D3S2_LENGTH                     equ 0001h
CLC1SEL2_D3S2_MASK                       equ 0004h
CLC1SEL2_D3S3_POSN                       equ 0003h
CLC1SEL2_D3S3_POSITION                   equ 0003h
CLC1SEL2_D3S3_SIZE                       equ 0001h
CLC1SEL2_D3S3_LENGTH                     equ 0001h
CLC1SEL2_D3S3_MASK                       equ 0008h
CLC1SEL2_D3S4_POSN                       equ 0004h
CLC1SEL2_D3S4_POSITION                   equ 0004h
CLC1SEL2_D3S4_SIZE                       equ 0001h
CLC1SEL2_D3S4_LENGTH                     equ 0001h
CLC1SEL2_D3S4_MASK                       equ 0010h
CLC1SEL2_D3S5_POSN                       equ 0005h
CLC1SEL2_D3S5_POSITION                   equ 0005h
CLC1SEL2_D3S5_SIZE                       equ 0001h
CLC1SEL2_D3S5_LENGTH                     equ 0001h
CLC1SEL2_D3S5_MASK                       equ 0020h
CLC1SEL2_D3S6_POSN                       equ 0006h
CLC1SEL2_D3S6_POSITION                   equ 0006h
CLC1SEL2_D3S6_SIZE                       equ 0001h
CLC1SEL2_D3S6_LENGTH                     equ 0001h
CLC1SEL2_D3S6_MASK                       equ 0040h
CLC1SEL2_D3S7_POSN                       equ 0007h
CLC1SEL2_D3S7_POSITION                   equ 0007h
CLC1SEL2_D3S7_SIZE                       equ 0001h
CLC1SEL2_D3S7_LENGTH                     equ 0001h
CLC1SEL2_D3S7_MASK                       equ 0080h
CLC1SEL2_LC1D3S0_POSN                    equ 0000h
CLC1SEL2_LC1D3S0_POSITION                equ 0000h
CLC1SEL2_LC1D3S0_SIZE                    equ 0001h
CLC1SEL2_LC1D3S0_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S0_MASK                    equ 0001h
CLC1SEL2_LC1D3S1_POSN                    equ 0001h
CLC1SEL2_LC1D3S1_POSITION                equ 0001h
CLC1SEL2_LC1D3S1_SIZE                    equ 0001h
CLC1SEL2_LC1D3S1_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S1_MASK                    equ 0002h
CLC1SEL2_LC1D3S2_POSN                    equ 0002h
CLC1SEL2_LC1D3S2_POSITION                equ 0002h
CLC1SEL2_LC1D3S2_SIZE                    equ 0001h
CLC1SEL2_LC1D3S2_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S2_MASK                    equ 0004h
CLC1SEL2_LC1D3S3_POSN                    equ 0003h
CLC1SEL2_LC1D3S3_POSITION                equ 0003h
CLC1SEL2_LC1D3S3_SIZE                    equ 0001h
CLC1SEL2_LC1D3S3_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S3_MASK                    equ 0008h
CLC1SEL2_LC1D3S4_POSN                    equ 0004h
CLC1SEL2_LC1D3S4_POSITION                equ 0004h
CLC1SEL2_LC1D3S4_SIZE                    equ 0001h
CLC1SEL2_LC1D3S4_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S4_MASK                    equ 0010h
CLC1SEL2_LC1D3S5_POSN                    equ 0005h
CLC1SEL2_LC1D3S5_POSITION                equ 0005h
CLC1SEL2_LC1D3S5_SIZE                    equ 0001h
CLC1SEL2_LC1D3S5_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S5_MASK                    equ 0020h
CLC1SEL2_LC1D3S6_POSN                    equ 0006h
CLC1SEL2_LC1D3S6_POSITION                equ 0006h
CLC1SEL2_LC1D3S6_SIZE                    equ 0001h
CLC1SEL2_LC1D3S6_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S6_MASK                    equ 0040h
CLC1SEL2_LC1D3S7_POSN                    equ 0007h
CLC1SEL2_LC1D3S7_POSITION                equ 0007h
CLC1SEL2_LC1D3S7_SIZE                    equ 0001h
CLC1SEL2_LC1D3S7_LENGTH                  equ 0001h
CLC1SEL2_LC1D3S7_MASK                    equ 0080h

// Register: CLC1SEL3
#define CLC1SEL3 CLC1SEL3
CLC1SEL3                                 equ 0E2Ch
// bitfield definitions
CLC1SEL3_D4S_POSN                        equ 0000h
CLC1SEL3_D4S_POSITION                    equ 0000h
CLC1SEL3_D4S_SIZE                        equ 0008h
CLC1SEL3_D4S_LENGTH                      equ 0008h
CLC1SEL3_D4S_MASK                        equ 00FFh
CLC1SEL3_LC1D4S_POSN                     equ 0000h
CLC1SEL3_LC1D4S_POSITION                 equ 0000h
CLC1SEL3_LC1D4S_SIZE                     equ 0008h
CLC1SEL3_LC1D4S_LENGTH                   equ 0008h
CLC1SEL3_LC1D4S_MASK                     equ 00FFh
CLC1SEL3_D4S0_POSN                       equ 0000h
CLC1SEL3_D4S0_POSITION                   equ 0000h
CLC1SEL3_D4S0_SIZE                       equ 0001h
CLC1SEL3_D4S0_LENGTH                     equ 0001h
CLC1SEL3_D4S0_MASK                       equ 0001h
CLC1SEL3_D4S1_POSN                       equ 0001h
CLC1SEL3_D4S1_POSITION                   equ 0001h
CLC1SEL3_D4S1_SIZE                       equ 0001h
CLC1SEL3_D4S1_LENGTH                     equ 0001h
CLC1SEL3_D4S1_MASK                       equ 0002h
CLC1SEL3_D4S2_POSN                       equ 0002h
CLC1SEL3_D4S2_POSITION                   equ 0002h
CLC1SEL3_D4S2_SIZE                       equ 0001h
CLC1SEL3_D4S2_LENGTH                     equ 0001h
CLC1SEL3_D4S2_MASK                       equ 0004h
CLC1SEL3_D4S3_POSN                       equ 0003h
CLC1SEL3_D4S3_POSITION                   equ 0003h
CLC1SEL3_D4S3_SIZE                       equ 0001h
CLC1SEL3_D4S3_LENGTH                     equ 0001h
CLC1SEL3_D4S3_MASK                       equ 0008h
CLC1SEL3_D4S4_POSN                       equ 0004h
CLC1SEL3_D4S4_POSITION                   equ 0004h
CLC1SEL3_D4S4_SIZE                       equ 0001h
CLC1SEL3_D4S4_LENGTH                     equ 0001h
CLC1SEL3_D4S4_MASK                       equ 0010h
CLC1SEL3_D4S5_POSN                       equ 0005h
CLC1SEL3_D4S5_POSITION                   equ 0005h
CLC1SEL3_D4S5_SIZE                       equ 0001h
CLC1SEL3_D4S5_LENGTH                     equ 0001h
CLC1SEL3_D4S5_MASK                       equ 0020h
CLC1SEL3_D4S6_POSN                       equ 0006h
CLC1SEL3_D4S6_POSITION                   equ 0006h
CLC1SEL3_D4S6_SIZE                       equ 0001h
CLC1SEL3_D4S6_LENGTH                     equ 0001h
CLC1SEL3_D4S6_MASK                       equ 0040h
CLC1SEL3_D4S7_POSN                       equ 0007h
CLC1SEL3_D4S7_POSITION                   equ 0007h
CLC1SEL3_D4S7_SIZE                       equ 0001h
CLC1SEL3_D4S7_LENGTH                     equ 0001h
CLC1SEL3_D4S7_MASK                       equ 0080h
CLC1SEL3_LC1D4S0_POSN                    equ 0000h
CLC1SEL3_LC1D4S0_POSITION                equ 0000h
CLC1SEL3_LC1D4S0_SIZE                    equ 0001h
CLC1SEL3_LC1D4S0_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S0_MASK                    equ 0001h
CLC1SEL3_LC1D4S1_POSN                    equ 0001h
CLC1SEL3_LC1D4S1_POSITION                equ 0001h
CLC1SEL3_LC1D4S1_SIZE                    equ 0001h
CLC1SEL3_LC1D4S1_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S1_MASK                    equ 0002h
CLC1SEL3_LC1D4S2_POSN                    equ 0002h
CLC1SEL3_LC1D4S2_POSITION                equ 0002h
CLC1SEL3_LC1D4S2_SIZE                    equ 0001h
CLC1SEL3_LC1D4S2_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S2_MASK                    equ 0004h
CLC1SEL3_LC1D4S3_POSN                    equ 0003h
CLC1SEL3_LC1D4S3_POSITION                equ 0003h
CLC1SEL3_LC1D4S3_SIZE                    equ 0001h
CLC1SEL3_LC1D4S3_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S3_MASK                    equ 0008h
CLC1SEL3_LC1D4S4_POSN                    equ 0004h
CLC1SEL3_LC1D4S4_POSITION                equ 0004h
CLC1SEL3_LC1D4S4_SIZE                    equ 0001h
CLC1SEL3_LC1D4S4_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S4_MASK                    equ 0010h
CLC1SEL3_LC1D4S5_POSN                    equ 0005h
CLC1SEL3_LC1D4S5_POSITION                equ 0005h
CLC1SEL3_LC1D4S5_SIZE                    equ 0001h
CLC1SEL3_LC1D4S5_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S5_MASK                    equ 0020h
CLC1SEL3_LC1D4S6_POSN                    equ 0006h
CLC1SEL3_LC1D4S6_POSITION                equ 0006h
CLC1SEL3_LC1D4S6_SIZE                    equ 0001h
CLC1SEL3_LC1D4S6_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S6_MASK                    equ 0040h
CLC1SEL3_LC1D4S7_POSN                    equ 0007h
CLC1SEL3_LC1D4S7_POSITION                equ 0007h
CLC1SEL3_LC1D4S7_SIZE                    equ 0001h
CLC1SEL3_LC1D4S7_LENGTH                  equ 0001h
CLC1SEL3_LC1D4S7_MASK                    equ 0080h

