GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: CLC6GLS2
#define CLC6GLS2 CLC6GLS2
CLC6GLS2                                 equ 0E61h
// bitfield definitions
CLC6GLS2_G3D1N_POSN                      equ 0000h
CLC6GLS2_G3D1N_POSITION                  equ 0000h
CLC6GLS2_G3D1N_SIZE                      equ 0001h
CLC6GLS2_G3D1N_LENGTH                    equ 0001h
CLC6GLS2_G3D1N_MASK                      equ 0001h
CLC6GLS2_G3D1T_POSN                      equ 0001h
CLC6GLS2_G3D1T_POSITION                  equ 0001h
CLC6GLS2_G3D1T_SIZE                      equ 0001h
CLC6GLS2_G3D1T_LENGTH                    equ 0001h
CLC6GLS2_G3D1T_MASK                      equ 0002h
CLC6GLS2_G3D2N_POSN                      equ 0002h
CLC6GLS2_G3D2N_POSITION                  equ 0002h
CLC6GLS2_G3D2N_SIZE                      equ 0001h
CLC6GLS2_G3D2N_LENGTH                    equ 0001h
CLC6GLS2_G3D2N_MASK                      equ 0004h
CLC6GLS2_G3D2T_POSN                      equ 0003h
CLC6GLS2_G3D2T_POSITION                  equ 0003h
CLC6GLS2_G3D2T_SIZE                      equ 0001h
CLC6GLS2_G3D2T_LENGTH                    equ 0001h
CLC6GLS2_G3D2T_MASK                      equ 0008h
CLC6GLS2_G3D3N_POSN                      equ 0004h
CLC6GLS2_G3D3N_POSITION                  equ 0004h
CLC6GLS2_G3D3N_SIZE                      equ 0001h
CLC6GLS2_G3D3N_LENGTH                    equ 0001h
CLC6GLS2_G3D3N_MASK                      equ 0010h
CLC6GLS2_G3D3T_POSN                      equ 0005h
CLC6GLS2_G3D3T_POSITION                  equ 0005h
CLC6GLS2_G3D3T_SIZE                      equ 0001h
CLC6GLS2_G3D3T_LENGTH                    equ 0001h
CLC6GLS2_G3D3T_MASK                      equ 0020h
CLC6GLS2_G3D4N_POSN                      equ 0006h
CLC6GLS2_G3D4N_POSITION                  equ 0006h
CLC6GLS2_G3D4N_SIZE                      equ 0001h
CLC6GLS2_G3D4N_LENGTH                    equ 0001h
CLC6GLS2_G3D4N_MASK                      equ 0040h
CLC6GLS2_G3D4T_POSN                      equ 0007h
CLC6GLS2_G3D4T_POSITION                  equ 0007h
CLC6GLS2_G3D4T_SIZE                      equ 0001h
CLC6GLS2_G3D4T_LENGTH                    equ 0001h
CLC6GLS2_G3D4T_MASK                      equ 0080h
CLC6GLS2_LC6G3D1N_POSN                   equ 0000h
CLC6GLS2_LC6G3D1N_POSITION               equ 0000h
CLC6GLS2_LC6G3D1N_SIZE                   equ 0001h
CLC6GLS2_LC6G3D1N_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D1N_MASK                   equ 0001h
CLC6GLS2_LC6G3D1T_POSN                   equ 0001h
CLC6GLS2_LC6G3D1T_POSITION               equ 0001h
CLC6GLS2_LC6G3D1T_SIZE                   equ 0001h
CLC6GLS2_LC6G3D1T_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D1T_MASK                   equ 0002h
CLC6GLS2_LC6G3D2N_POSN                   equ 0002h
CLC6GLS2_LC6G3D2N_POSITION               equ 0002h
CLC6GLS2_LC6G3D2N_SIZE                   equ 0001h
CLC6GLS2_LC6G3D2N_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D2N_MASK                   equ 0004h
CLC6GLS2_LC6G3D2T_POSN                   equ 0003h
CLC6GLS2_LC6G3D2T_POSITION               equ 0003h
CLC6GLS2_LC6G3D2T_SIZE                   equ 0001h
CLC6GLS2_LC6G3D2T_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D2T_MASK                   equ 0008h
CLC6GLS2_LC6G3D3N_POSN                   equ 0004h
CLC6GLS2_LC6G3D3N_POSITION               equ 0004h
CLC6GLS2_LC6G3D3N_SIZE                   equ 0001h
CLC6GLS2_LC6G3D3N_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D3N_MASK                   equ 0010h
CLC6GLS2_LC6G3D3T_POSN                   equ 0005h
CLC6GLS2_LC6G3D3T_POSITION               equ 0005h
CLC6GLS2_LC6G3D3T_SIZE                   equ 0001h
CLC6GLS2_LC6G3D3T_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D3T_MASK                   equ 0020h
CLC6GLS2_LC6G3D4N_POSN                   equ 0006h
CLC6GLS2_LC6G3D4N_POSITION               equ 0006h
CLC6GLS2_LC6G3D4N_SIZE                   equ 0001h
CLC6GLS2_LC6G3D4N_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D4N_MASK                   equ 0040h
CLC6GLS2_LC6G3D4T_POSN                   equ 0007h
CLC6GLS2_LC6G3D4T_POSITION               equ 0007h
CLC6GLS2_LC6G3D4T_SIZE                   equ 0001h
CLC6GLS2_LC6G3D4T_LENGTH                 equ 0001h
CLC6GLS2_LC6G3D4T_MASK                   equ 0080h

// Register: CLC6GLS3
#define CLC6GLS3 CLC6GLS3
CLC6GLS3                                 equ 0E62h
// bitfield definitions
CLC6GLS3_G4D1N_POSN                      equ 0000h
CLC6GLS3_G4D1N_POSITION                  equ 0000h
CLC6GLS3_G4D1N_SIZE                      equ 0001h
CLC6GLS3_G4D1N_LENGTH                    equ 0001h
CLC6GLS3_G4D1N_MASK                      equ 0001h
CLC6GLS3_G4D1T_POSN                      equ 0001h
CLC6GLS3_G4D1T_POSITION                  equ 0001h
CLC6GLS3_G4D1T_SIZE                      equ 0001h
CLC6GLS3_G4D1T_LENGTH                    equ 0001h
CLC6GLS3_G4D1T_MASK                      equ 0002h
CLC6GLS3_G4D2N_POSN                      equ 0002h
CLC6GLS3_G4D2N_POSITION                  equ 0002h
CLC6GLS3_G4D2N_SIZE                      equ 0001h
CLC6GLS3_G4D2N_LENGTH                    equ 0001h
CLC6GLS3_G4D2N_MASK                      equ 0004h
CLC6GLS3_G4D2T_POSN                      equ 0003h
CLC6GLS3_G4D2T_POSITION                  equ 0003h
CLC6GLS3_G4D2T_SIZE                      equ 0001h
CLC6GLS3_G4D2T_LENGTH                    equ 0001h
CLC6GLS3_G4D2T_MASK                      equ 0008h
CLC6GLS3_G4D3N_POSN                      equ 0004h
CLC6GLS3_G4D3N_POSITION                  equ 0004h
CLC6GLS3_G4D3N_SIZE                      equ 0001h
CLC6GLS3_G4D3N_LENGTH                    equ 0001h
CLC6GLS3_G4D3N_MASK                      equ 0010h
CLC6GLS3_G4D3T_POSN                      equ 0005h
CLC6GLS3_G4D3T_POSITION                  equ 0005h
CLC6GLS3_G4D3T_SIZE                      equ 0001h
CLC6GLS3_G4D3T_LENGTH                    equ 0001h
CLC6GLS3_G4D3T_MASK                      equ 0020h
CLC6GLS3_G4D4N_POSN                      equ 0006h
CLC6GLS3_G4D4N_POSITION                  equ 0006h
CLC6GLS3_G4D4N_SIZE                      equ 0001h
CLC6GLS3_G4D4N_LENGTH                    equ 0001h
CLC6GLS3_G4D4N_MASK                      equ 0040h
CLC6GLS3_G4D4T_POSN                      equ 0007h
CLC6GLS3_G4D4T_POSITION                  equ 0007h
CLC6GLS3_G4D4T_SIZE                      equ 0001h
CLC6GLS3_G4D4T_LENGTH                    equ 0001h
CLC6GLS3_G4D4T_MASK                      equ 0080h
CLC6GLS3_LC6G4D1N_POSN                   equ 0000h
CLC6GLS3_LC6G4D1N_POSITION               equ 0000h
CLC6GLS3_LC6G4D1N_SIZE                   equ 0001h
CLC6GLS3_LC6G4D1N_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D1N_MASK                   equ 0001h
CLC6GLS3_LC6G4D1T_POSN                   equ 0001h
CLC6GLS3_LC6G4D1T_POSITION               equ 0001h
CLC6GLS3_LC6G4D1T_SIZE                   equ 0001h
CLC6GLS3_LC6G4D1T_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D1T_MASK                   equ 0002h
CLC6GLS3_LC6G4D2N_POSN                   equ 0002h
CLC6GLS3_LC6G4D2N_POSITION               equ 0002h
CLC6GLS3_LC6G4D2N_SIZE                   equ 0001h
CLC6GLS3_LC6G4D2N_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D2N_MASK                   equ 0004h
CLC6GLS3_LC6G4D2T_POSN                   equ 0003h
CLC6GLS3_LC6G4D2T_POSITION               equ 0003h
CLC6GLS3_LC6G4D2T_SIZE                   equ 0001h
CLC6GLS3_LC6G4D2T_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D2T_MASK                   equ 0008h
CLC6GLS3_LC6G4D3N_POSN                   equ 0004h
CLC6GLS3_LC6G4D3N_POSITION               equ 0004h
CLC6GLS3_LC6G4D3N_SIZE                   equ 0001h
CLC6GLS3_LC6G4D3N_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D3N_MASK                   equ 0010h
CLC6GLS3_LC6G4D3T_POSN                   equ 0005h
CLC6GLS3_LC6G4D3T_POSITION               equ 0005h
CLC6GLS3_LC6G4D3T_SIZE                   equ 0001h
CLC6GLS3_LC6G4D3T_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D3T_MASK                   equ 0020h
CLC6GLS3_LC6G4D4N_POSN                   equ 0006h
CLC6GLS3_LC6G4D4N_POSITION               equ 0006h
CLC6GLS3_LC6G4D4N_SIZE                   equ 0001h
CLC6GLS3_LC6G4D4N_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D4N_MASK                   equ 0040h
CLC6GLS3_LC6G4D4T_POSN                   equ 0007h
CLC6GLS3_LC6G4D4T_POSITION               equ 0007h
CLC6GLS3_LC6G4D4T_SIZE                   equ 0001h
CLC6GLS3_LC6G4D4T_LENGTH                 equ 0001h
CLC6GLS3_LC6G4D4T_MASK                   equ 0080h

