GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: CLC7CON
#define CLC7CON CLC7CON
CLC7CON                                  equ 0E63h
// bitfield definitions
CLC7CON_MODE_POSN                        equ 0000h
CLC7CON_MODE_POSITION                    equ 0000h
CLC7CON_MODE_SIZE                        equ 0003h
CLC7CON_MODE_LENGTH                      equ 0003h
CLC7CON_MODE_MASK                        equ 0007h
CLC7CON_INTN_POSN                        equ 0003h
CLC7CON_INTN_POSITION                    equ 0003h
CLC7CON_INTN_SIZE                        equ 0001h
CLC7CON_INTN_LENGTH                      equ 0001h
CLC7CON_INTN_MASK                        equ 0008h
CLC7CON_INTP_POSN                        equ 0004h
CLC7CON_INTP_POSITION                    equ 0004h
CLC7CON_INTP_SIZE                        equ 0001h
CLC7CON_INTP_LENGTH                      equ 0001h
CLC7CON_INTP_MASK                        equ 0010h
CLC7CON_OUT_POSN                         equ 0005h
CLC7CON_OUT_POSITION                     equ 0005h
CLC7CON_OUT_SIZE                         equ 0001h
CLC7CON_OUT_LENGTH                       equ 0001h
CLC7CON_OUT_MASK                         equ 0020h
CLC7CON_EN_POSN                          equ 0007h
CLC7CON_EN_POSITION                      equ 0007h
CLC7CON_EN_SIZE                          equ 0001h
CLC7CON_EN_LENGTH                        equ 0001h
CLC7CON_EN_MASK                          equ 0080h
CLC7CON_MODE0_POSN                       equ 0000h
CLC7CON_MODE0_POSITION                   equ 0000h
CLC7CON_MODE0_SIZE                       equ 0001h
CLC7CON_MODE0_LENGTH                     equ 0001h
CLC7CON_MODE0_MASK                       equ 0001h
CLC7CON_MODE1_POSN                       equ 0001h
CLC7CON_MODE1_POSITION                   equ 0001h
CLC7CON_MODE1_SIZE                       equ 0001h
CLC7CON_MODE1_LENGTH                     equ 0001h
CLC7CON_MODE1_MASK                       equ 0002h
CLC7CON_MODE2_POSN                       equ 0002h
CLC7CON_MODE2_POSITION                   equ 0002h
CLC7CON_MODE2_SIZE                       equ 0001h
CLC7CON_MODE2_LENGTH                     equ 0001h
CLC7CON_MODE2_MASK                       equ 0004h
CLC7CON_LC7MODE_POSN                     equ 0000h
CLC7CON_LC7MODE_POSITION                 equ 0000h
CLC7CON_LC7MODE_SIZE                     equ 0003h
CLC7CON_LC7MODE_LENGTH                   equ 0003h
CLC7CON_LC7MODE_MASK                     equ 0007h
CLC7CON_LC7INTN_POSN                     equ 0003h
CLC7CON_LC7INTN_POSITION                 equ 0003h
CLC7CON_LC7INTN_SIZE                     equ 0001h
CLC7CON_LC7INTN_LENGTH                   equ 0001h
CLC7CON_LC7INTN_MASK                     equ 0008h
CLC7CON_LC7INTP_POSN                     equ 0004h
CLC7CON_LC7INTP_POSITION                 equ 0004h
CLC7CON_LC7INTP_SIZE                     equ 0001h
CLC7CON_LC7INTP_LENGTH                   equ 0001h
CLC7CON_LC7INTP_MASK                     equ 0010h
CLC7CON_LC7OUT_POSN                      equ 0005h
CLC7CON_LC7OUT_POSITION                  equ 0005h
CLC7CON_LC7OUT_SIZE                      equ 0001h
CLC7CON_LC7OUT_LENGTH                    equ 0001h
CLC7CON_LC7OUT_MASK                      equ 0020h
CLC7CON_LC7EN_POSN                       equ 0007h
CLC7CON_LC7EN_POSITION                   equ 0007h
CLC7CON_LC7EN_SIZE                       equ 0001h
CLC7CON_LC7EN_LENGTH                     equ 0001h
CLC7CON_LC7EN_MASK                       equ 0080h
CLC7CON_LC7MODE0_POSN                    equ 0000h
CLC7CON_LC7MODE0_POSITION                equ 0000h
CLC7CON_LC7MODE0_SIZE                    equ 0001h
CLC7CON_LC7MODE0_LENGTH                  equ 0001h
CLC7CON_LC7MODE0_MASK                    equ 0001h
CLC7CON_LC7MODE1_POSN                    equ 0001h
CLC7CON_LC7MODE1_POSITION                equ 0001h
CLC7CON_LC7MODE1_SIZE                    equ 0001h
CLC7CON_LC7MODE1_LENGTH                  equ 0001h
CLC7CON_LC7MODE1_MASK                    equ 0002h
CLC7CON_LC7MODE2_POSN                    equ 0002h
CLC7CON_LC7MODE2_POSITION                equ 0002h
CLC7CON_LC7MODE2_SIZE                    equ 0001h
CLC7CON_LC7MODE2_LENGTH                  equ 0001h
CLC7CON_LC7MODE2_MASK                    equ 0004h

// Register: CLC7POL
#define CLC7POL CLC7POL
CLC7POL                                  equ 0E64h
// bitfield definitions
CLC7POL_G1POL_POSN                       equ 0000h
CLC7POL_G1POL_POSITION                   equ 0000h
CLC7POL_G1POL_SIZE                       equ 0001h
CLC7POL_G1POL_LENGTH                     equ 0001h
CLC7POL_G1POL_MASK                       equ 0001h
CLC7POL_G2POL_POSN                       equ 0001h
CLC7POL_G2POL_POSITION                   equ 0001h
CLC7POL_G2POL_SIZE                       equ 0001h
CLC7POL_G2POL_LENGTH                     equ 0001h
CLC7POL_G2POL_MASK                       equ 0002h
CLC7POL_G3POL_POSN                       equ 0002h
CLC7POL_G3POL_POSITION                   equ 0002h
CLC7POL_G3POL_SIZE                       equ 0001h
CLC7POL_G3POL_LENGTH                     equ 0001h
CLC7POL_G3POL_MASK                       equ 0004h
CLC7POL_G4POL_POSN                       equ 0003h
CLC7POL_G4POL_POSITION                   equ 0003h
CLC7POL_G4POL_SIZE                       equ 0001h
CLC7POL_G4POL_LENGTH                     equ 0001h
CLC7POL_G4POL_MASK                       equ 0008h
CLC7POL_POL_POSN                         equ 0007h
CLC7POL_POL_POSITION                     equ 0007h
CLC7POL_POL_SIZE                         equ 0001h
CLC7POL_POL_LENGTH                       equ 0001h
CLC7POL_POL_MASK                         equ 0080h
CLC7POL_LC7G1POL_POSN                    equ 0000h
CLC7POL_LC7G1POL_POSITION                equ 0000h
CLC7POL_LC7G1POL_SIZE                    equ 0001h
CLC7POL_LC7G1POL_LENGTH                  equ 0001h
CLC7POL_LC7G1POL_MASK                    equ 0001h
CLC7POL_LC7G2POL_POSN                    equ 0001h
CLC7POL_LC7G2POL_POSITION                equ 0001h
CLC7POL_LC7G2POL_SIZE                    equ 0001h
CLC7POL_LC7G2POL_LENGTH                  equ 0001h
CLC7POL_LC7G2POL_MASK                    equ 0002h
CLC7POL_LC7G3POL_POSN                    equ 0002h
CLC7POL_LC7G3POL_POSITION                equ 0002h
CLC7POL_LC7G3POL_SIZE                    equ 0001h
CLC7POL_LC7G3POL_LENGTH                  equ 0001h
CLC7POL_LC7G3POL_MASK                    equ 0004h
CLC7POL_LC7G4POL_POSN                    equ 0003h
CLC7POL_LC7G4POL_POSITION                equ 0003h
CLC7POL_LC7G4POL_SIZE                    equ 0001h
CLC7POL_LC7G4POL_LENGTH                  equ 0001h
CLC7POL_LC7G4POL_MASK                    equ 0008h
CLC7POL_LC7POL_POSN                      equ 0007h
CLC7POL_LC7POL_POSITION                  equ 0007h
CLC7POL_LC7POL_SIZE                      equ 0001h
CLC7POL_LC7POL_LENGTH                    equ 0001h
CLC7POL_LC7POL_MASK                      equ 0080h

// Register: CLC7SEL0
#define CLC7SEL0 CLC7SEL0
CLC7SEL0                                 equ 0E65h
// bitfield definitions
CLC7SEL0_D1S_POSN                        equ 0000h
CLC7SEL0_D1S_POSITION                    equ 0000h
CLC7SEL0_D1S_SIZE                        equ 0008h
CLC7SEL0_D1S_LENGTH                      equ 0008h
CLC7SEL0_D1S_MASK                        equ 00FFh
CLC7SEL0_LC7D1S_POSN                     equ 0000h
CLC7SEL0_LC7D1S_POSITION                 equ 0000h
CLC7SEL0_LC7D1S_SIZE                     equ 0008h
CLC7SEL0_LC7D1S_LENGTH                   equ 0008h
CLC7SEL0_LC7D1S_MASK                     equ 00FFh
CLC7SEL0_D1S0_POSN                       equ 0000h
CLC7SEL0_D1S0_POSITION                   equ 0000h
CLC7SEL0_D1S0_SIZE                       equ 0001h
CLC7SEL0_D1S0_LENGTH                     equ 0001h
CLC7SEL0_D1S0_MASK                       equ 0001h
CLC7SEL0_D1S1_POSN                       equ 0001h
CLC7SEL0_D1S1_POSITION                   equ 0001h
CLC7SEL0_D1S1_SIZE                       equ 0001h
CLC7SEL0_D1S1_LENGTH                     equ 0001h
CLC7SEL0_D1S1_MASK                       equ 0002h
CLC7SEL0_D1S2_POSN                       equ 0002h
CLC7SEL0_D1S2_POSITION                   equ 0002h
CLC7SEL0_D1S2_SIZE                       equ 0001h
CLC7SEL0_D1S2_LENGTH                     equ 0001h
CLC7SEL0_D1S2_MASK                       equ 0004h
CLC7SEL0_D1S3_POSN                       equ 0003h
CLC7SEL0_D1S3_POSITION                   equ 0003h
CLC7SEL0_D1S3_SIZE                       equ 0001h
CLC7SEL0_D1S3_LENGTH                     equ 0001h
CLC7SEL0_D1S3_MASK                       equ 0008h
CLC7SEL0_D1S4_POSN                       equ 0004h
CLC7SEL0_D1S4_POSITION                   equ 0004h
CLC7SEL0_D1S4_SIZE                       equ 0001h
CLC7SEL0_D1S4_LENGTH                     equ 0001h
CLC7SEL0_D1S4_MASK                       equ 0010h
CLC7SEL0_D1S5_POSN                       equ 0005h
CLC7SEL0_D1S5_POSITION                   equ 0005h
CLC7SEL0_D1S5_SIZE                       equ 0001h
CLC7SEL0_D1S5_LENGTH                     equ 0001h
CLC7SEL0_D1S5_MASK                       equ 0020h
CLC7SEL0_D1S6_POSN                       equ 0006h
CLC7SEL0_D1S6_POSITION                   equ 0006h
CLC7SEL0_D1S6_SIZE                       equ 0001h
CLC7SEL0_D1S6_LENGTH                     equ 0001h
CLC7SEL0_D1S6_MASK                       equ 0040h
CLC7SEL0_D1S7_POSN                       equ 0007h
CLC7SEL0_D1S7_POSITION                   equ 0007h
CLC7SEL0_D1S7_SIZE                       equ 0001h
CLC7SEL0_D1S7_LENGTH                     equ 0001h
CLC7SEL0_D1S7_MASK                       equ 0080h
CLC7SEL0_LC7D1S0_POSN                    equ 0000h
CLC7SEL0_LC7D1S0_POSITION                equ 0000h
CLC7SEL0_LC7D1S0_SIZE                    equ 0001h
CLC7SEL0_LC7D1S0_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S0_MASK                    equ 0001h
CLC7SEL0_LC7D1S1_POSN                    equ 0001h
CLC7SEL0_LC7D1S1_POSITION                equ 0001h
CLC7SEL0_LC7D1S1_SIZE                    equ 0001h
CLC7SEL0_LC7D1S1_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S1_MASK                    equ 0002h
CLC7SEL0_LC7D1S2_POSN                    equ 0002h
CLC7SEL0_LC7D1S2_POSITION                equ 0002h
CLC7SEL0_LC7D1S2_SIZE                    equ 0001h
CLC7SEL0_LC7D1S2_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S2_MASK                    equ 0004h
CLC7SEL0_LC7D1S3_POSN                    equ 0003h
CLC7SEL0_LC7D1S3_POSITION                equ 0003h
CLC7SEL0_LC7D1S3_SIZE                    equ 0001h
CLC7SEL0_LC7D1S3_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S3_MASK                    equ 0008h
CLC7SEL0_LC7D1S4_POSN                    equ 0004h
CLC7SEL0_LC7D1S4_POSITION                equ 0004h
CLC7SEL0_LC7D1S4_SIZE                    equ 0001h
CLC7SEL0_LC7D1S4_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S4_MASK                    equ 0010h
CLC7SEL0_LC7D1S5_POSN                    equ 0005h
CLC7SEL0_LC7D1S5_POSITION                equ 0005h
CLC7SEL0_LC7D1S5_SIZE                    equ 0001h
CLC7SEL0_LC7D1S5_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S5_MASK                    equ 0020h
CLC7SEL0_LC7D1S6_POSN                    equ 0006h
CLC7SEL0_LC7D1S6_POSITION                equ 0006h
CLC7SEL0_LC7D1S6_SIZE                    equ 0001h
CLC7SEL0_LC7D1S6_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S6_MASK                    equ 0040h
CLC7SEL0_LC7D1S7_POSN                    equ 0007h
CLC7SEL0_LC7D1S7_POSITION                equ 0007h
CLC7SEL0_LC7D1S7_SIZE                    equ 0001h
CLC7SEL0_LC7D1S7_LENGTH                  equ 0001h
CLC7SEL0_LC7D1S7_MASK                    equ 0080h

// Register: CLC7SEL1
#define CLC7SEL1 CLC7SEL1
CLC7SEL1                                 equ 0E66h
// bitfield definitions
CLC7SEL1_D2S_POSN                        equ 0000h
CLC7SEL1_D2S_POSITION                    equ 0000h
CLC7SEL1_D2S_SIZE                        equ 0008h
CLC7SEL1_D2S_LENGTH                      equ 0008h
CLC7SEL1_D2S_MASK                        equ 00FFh
CLC7SEL1_LC7D2S_POSN                     equ 0000h
CLC7SEL1_LC7D2S_POSITION                 equ 0000h
CLC7SEL1_LC7D2S_SIZE                     equ 0008h
CLC7SEL1_LC7D2S_LENGTH                   equ 0008h
CLC7SEL1_LC7D2S_MASK                     equ 00FFh
CLC7SEL1_D2S0_POSN                       equ 0000h
CLC7SEL1_D2S0_POSITION                   equ 0000h
CLC7SEL1_D2S0_SIZE                       equ 0001h
CLC7SEL1_D2S0_LENGTH                     equ 0001h
CLC7SEL1_D2S0_MASK                       equ 0001h
CLC7SEL1_D2S1_POSN                       equ 0001h
CLC7SEL1_D2S1_POSITION                   equ 0001h
CLC7SEL1_D2S1_SIZE                       equ 0001h
CLC7SEL1_D2S1_LENGTH                     equ 0001h
CLC7SEL1_D2S1_MASK                       equ 0002h
CLC7SEL1_D2S2_POSN                       equ 0002h
CLC7SEL1_D2S2_POSITION                   equ 0002h
CLC7SEL1_D2S2_SIZE                       equ 0001h
CLC7SEL1_D2S2_LENGTH                     equ 0001h
CLC7SEL1_D2S2_MASK                       equ 0004h
CLC7SEL1_D2S3_POSN                       equ 0003h
CLC7SEL1_D2S3_POSITION                   equ 0003h
CLC7SEL1_D2S3_SIZE                       equ 0001h
CLC7SEL1_D2S3_LENGTH                     equ 0001h
CLC7SEL1_D2S3_MASK                       equ 0008h
CLC7SEL1_D2S4_POSN                       equ 0004h
CLC7SEL1_D2S4_POSITION                   equ 0004h
CLC7SEL1_D2S4_SIZE                       equ 0001h
CLC7SEL1_D2S4_LENGTH                     equ 0001h
CLC7SEL1_D2S4_MASK                       equ 0010h
CLC7SEL1_D2S5_POSN                       equ 0005h
CLC7SEL1_D2S5_POSITION                   equ 0005h
CLC7SEL1_D2S5_SIZE                       equ 0001h
CLC7SEL1_D2S5_LENGTH                     equ 0001h
CLC7SEL1_D2S5_MASK                       equ 0020h
CLC7SEL1_D2S6_POSN                       equ 0006h
CLC7SEL1_D2S6_POSITION                   equ 0006h
CLC7SEL1_D2S6_SIZE                       equ 0001h
CLC7SEL1_D2S6_LENGTH                     equ 0001h
CLC7SEL1_D2S6_MASK                       equ 0040h
CLC7SEL1_D2S7_POSN                       equ 0007h
CLC7SEL1_D2S7_POSITION                   equ 0007h
CLC7SEL1_D2S7_SIZE                       equ 0001h
CLC7SEL1_D2S7_LENGTH                     equ 0001h
CLC7SEL1_D2S7_MASK                       equ 0080h
CLC7SEL1_LC7D2S0_POSN                    equ 0000h
CLC7SEL1_LC7D2S0_POSITION                equ 0000h
CLC7SEL1_LC7D2S0_SIZE                    equ 0001h
CLC7SEL1_LC7D2S0_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S0_MASK                    equ 0001h
CLC7SEL1_LC7D2S1_POSN                    equ 0001h
CLC7SEL1_LC7D2S1_POSITION                equ 0001h
CLC7SEL1_LC7D2S1_SIZE                    equ 0001h
CLC7SEL1_LC7D2S1_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S1_MASK                    equ 0002h
CLC7SEL1_LC7D2S2_POSN                    equ 0002h
CLC7SEL1_LC7D2S2_POSITION                equ 0002h
CLC7SEL1_LC7D2S2_SIZE                    equ 0001h
CLC7SEL1_LC7D2S2_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S2_MASK                    equ 0004h
CLC7SEL1_LC7D2S3_POSN                    equ 0003h
CLC7SEL1_LC7D2S3_POSITION                equ 0003h
CLC7SEL1_LC7D2S3_SIZE                    equ 0001h
CLC7SEL1_LC7D2S3_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S3_MASK                    equ 0008h
CLC7SEL1_LC7D2S4_POSN                    equ 0004h
CLC7SEL1_LC7D2S4_POSITION                equ 0004h
CLC7SEL1_LC7D2S4_SIZE                    equ 0001h
CLC7SEL1_LC7D2S4_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S4_MASK                    equ 0010h
CLC7SEL1_LC7D2S5_POSN                    equ 0005h
CLC7SEL1_LC7D2S5_POSITION                equ 0005h
CLC7SEL1_LC7D2S5_SIZE                    equ 0001h
CLC7SEL1_LC7D2S5_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S5_MASK                    equ 0020h
CLC7SEL1_LC7D2S6_POSN                    equ 0006h
CLC7SEL1_LC7D2S6_POSITION                equ 0006h
CLC7SEL1_LC7D2S6_SIZE                    equ 0001h
CLC7SEL1_LC7D2S6_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S6_MASK                    equ 0040h
CLC7SEL1_LC7D2S7_POSN                    equ 0007h
CLC7SEL1_LC7D2S7_POSITION                equ 0007h
CLC7SEL1_LC7D2S7_SIZE                    equ 0001h
CLC7SEL1_LC7D2S7_LENGTH                  equ 0001h
CLC7SEL1_LC7D2S7_MASK                    equ 0080h

// Register: CLC7SEL2
#define CLC7SEL2 CLC7SEL2
CLC7SEL2                                 equ 0E67h
// bitfield definitions
CLC7SEL2_D3S_POSN                        equ 0000h
CLC7SEL2_D3S_POSITION                    equ 0000h
CLC7SEL2_D3S_SIZE                        equ 0008h
CLC7SEL2_D3S_LENGTH                      equ 0008h
CLC7SEL2_D3S_MASK                        equ 00FFh
CLC7SEL2_LC7D3S_POSN                     equ 0000h
CLC7SEL2_LC7D3S_POSITION                 equ 0000h
CLC7SEL2_LC7D3S_SIZE                     equ 0008h
CLC7SEL2_LC7D3S_LENGTH                   equ 0008h
CLC7SEL2_LC7D3S_MASK                     equ 00FFh
CLC7SEL2_D3S0_POSN                       equ 0000h
CLC7SEL2_D3S0_POSITION                   equ 0000h
CLC7SEL2_D3S0_SIZE                       equ 0001h
CLC7SEL2_D3S0_LENGTH                     equ 0001h
CLC7SEL2_D3S0_MASK                       equ 0001h
CLC7SEL2_D3S1_POSN                       equ 0001h
CLC7SEL2_D3S1_POSITION                   equ 0001h
CLC7SEL2_D3S1_SIZE                       equ 0001h
CLC7SEL2_D3S1_LENGTH                     equ 0001h
CLC7SEL2_D3S1_MASK                       equ 0002h
CLC7SEL2_D3S2_POSN                       equ 0002h
CLC7SEL2_D3S2_POSITION                   equ 0002h
CLC7SEL2_D3S2_SIZE                       equ 0001h
CLC7SEL2_D3S2_LENGTH                     equ 0001h
CLC7SEL2_D3S2_MASK                       equ 0004h
CLC7SEL2_D3S3_POSN                       equ 0003h
CLC7SEL2_D3S3_POSITION                   equ 0003h
CLC7SEL2_D3S3_SIZE                       equ 0001h
CLC7SEL2_D3S3_LENGTH                     equ 0001h
CLC7SEL2_D3S3_MASK                       equ 0008h
CLC7SEL2_D3S4_POSN                       equ 0004h
CLC7SEL2_D3S4_POSITION                   equ 0004h
CLC7SEL2_D3S4_SIZE                       equ 0001h
CLC7SEL2_D3S4_LENGTH                     equ 0001h
CLC7SEL2_D3S4_MASK                       equ 0010h
CLC7SEL2_D3S5_POSN                       equ 0005h
CLC7SEL2_D3S5_POSITION                   equ 0005h
CLC7SEL2_D3S5_SIZE                       equ 0001h
CLC7SEL2_D3S5_LENGTH                     equ 0001h
CLC7SEL2_D3S5_MASK                       equ 0020h
CLC7SEL2_D3S6_POSN                       equ 0006h
CLC7SEL2_D3S6_POSITION                   equ 0006h
CLC7SEL2_D3S6_SIZE                       equ 0001h
CLC7SEL2_D3S6_LENGTH                     equ 0001h
CLC7SEL2_D3S6_MASK                       equ 0040h
CLC7SEL2_D3S7_POSN                       equ 0007h
CLC7SEL2_D3S7_POSITION                   equ 0007h
CLC7SEL2_D3S7_SIZE                       equ 0001h
CLC7SEL2_D3S7_LENGTH                     equ 0001h
CLC7SEL2_D3S7_MASK                       equ 0080h
CLC7SEL2_LC7D3S0_POSN                    equ 0000h
CLC7SEL2_LC7D3S0_POSITION                equ 0000h
CLC7SEL2_LC7D3S0_SIZE                    equ 0001h
CLC7SEL2_LC7D3S0_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S0_MASK                    equ 0001h
CLC7SEL2_LC7D3S1_POSN                    equ 0001h
CLC7SEL2_LC7D3S1_POSITION                equ 0001h
CLC7SEL2_LC7D3S1_SIZE                    equ 0001h
CLC7SEL2_LC7D3S1_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S1_MASK                    equ 0002h
CLC7SEL2_LC7D3S2_POSN                    equ 0002h
CLC7SEL2_LC7D3S2_POSITION                equ 0002h
CLC7SEL2_LC7D3S2_SIZE                    equ 0001h
CLC7SEL2_LC7D3S2_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S2_MASK                    equ 0004h
CLC7SEL2_LC7D3S3_POSN                    equ 0003h
CLC7SEL2_LC7D3S3_POSITION                equ 0003h
CLC7SEL2_LC7D3S3_SIZE                    equ 0001h
CLC7SEL2_LC7D3S3_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S3_MASK                    equ 0008h
CLC7SEL2_LC7D3S4_POSN                    equ 0004h
CLC7SEL2_LC7D3S4_POSITION                equ 0004h
CLC7SEL2_LC7D3S4_SIZE                    equ 0001h
CLC7SEL2_LC7D3S4_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S4_MASK                    equ 0010h
CLC7SEL2_LC7D3S5_POSN                    equ 0005h
CLC7SEL2_LC7D3S5_POSITION                equ 0005h
CLC7SEL2_LC7D3S5_SIZE                    equ 0001h
CLC7SEL2_LC7D3S5_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S5_MASK                    equ 0020h
CLC7SEL2_LC7D3S6_POSN                    equ 0006h
CLC7SEL2_LC7D3S6_POSITION                equ 0006h
CLC7SEL2_LC7D3S6_SIZE                    equ 0001h
CLC7SEL2_LC7D3S6_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S6_MASK                    equ 0040h
CLC7SEL2_LC7D3S7_POSN                    equ 0007h
CLC7SEL2_LC7D3S7_POSITION                equ 0007h
CLC7SEL2_LC7D3S7_SIZE                    equ 0001h
CLC7SEL2_LC7D3S7_LENGTH                  equ 0001h
CLC7SEL2_LC7D3S7_MASK                    equ 0080h

