GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: MDSRC
#define MDSRC MDSRC
MDSRC                                    equ 0F4Eh
// bitfield definitions
MDSRC_SRCS0_POSN                         equ 0000h
MDSRC_SRCS0_POSITION                     equ 0000h
MDSRC_SRCS0_SIZE                         equ 0001h
MDSRC_SRCS0_LENGTH                       equ 0001h
MDSRC_SRCS0_MASK                         equ 0001h
MDSRC_SRCS1_POSN                         equ 0001h
MDSRC_SRCS1_POSITION                     equ 0001h
MDSRC_SRCS1_SIZE                         equ 0001h
MDSRC_SRCS1_LENGTH                       equ 0001h
MDSRC_SRCS1_MASK                         equ 0002h
MDSRC_SRCS2_POSN                         equ 0002h
MDSRC_SRCS2_POSITION                     equ 0002h
MDSRC_SRCS2_SIZE                         equ 0001h
MDSRC_SRCS2_LENGTH                       equ 0001h
MDSRC_SRCS2_MASK                         equ 0004h
MDSRC_SRCS3_POSN                         equ 0003h
MDSRC_SRCS3_POSITION                     equ 0003h
MDSRC_SRCS3_SIZE                         equ 0001h
MDSRC_SRCS3_LENGTH                       equ 0001h
MDSRC_SRCS3_MASK                         equ 0008h
MDSRC_SRCS_POSN                          equ 0000h
MDSRC_SRCS_POSITION                      equ 0000h
MDSRC_SRCS_SIZE                          equ 0004h
MDSRC_SRCS_LENGTH                        equ 0004h
MDSRC_SRCS_MASK                          equ 000Fh
MDSRC_MDSRCS_POSN                        equ 0000h
MDSRC_MDSRCS_POSITION                    equ 0000h
MDSRC_MDSRCS_SIZE                        equ 0004h
MDSRC_MDSRCS_LENGTH                      equ 0004h
MDSRC_MDSRCS_MASK                        equ 000Fh
MDSRC_MDSRCS0_POSN                       equ 0000h
MDSRC_MDSRCS0_POSITION                   equ 0000h
MDSRC_MDSRCS0_SIZE                       equ 0001h
MDSRC_MDSRCS0_LENGTH                     equ 0001h
MDSRC_MDSRCS0_MASK                       equ 0001h
MDSRC_MDSRCS1_POSN                       equ 0001h
MDSRC_MDSRCS1_POSITION                   equ 0001h
MDSRC_MDSRCS1_SIZE                       equ 0001h
MDSRC_MDSRCS1_LENGTH                     equ 0001h
MDSRC_MDSRCS1_MASK                       equ 0002h
MDSRC_MDSRCS2_POSN                       equ 0002h
MDSRC_MDSRCS2_POSITION                   equ 0002h
MDSRC_MDSRCS2_SIZE                       equ 0001h
MDSRC_MDSRCS2_LENGTH                     equ 0001h
MDSRC_MDSRCS2_MASK                       equ 0004h
MDSRC_MDSRCS3_POSN                       equ 0003h
MDSRC_MDSRCS3_POSITION                   equ 0003h
MDSRC_MDSRCS3_SIZE                       equ 0001h
MDSRC_MDSRCS3_LENGTH                     equ 0001h
MDSRC_MDSRCS3_MASK                       equ 0008h

// Register: MDCARL
#define MDCARL MDCARL
MDCARL                                   equ 0F4Fh
// bitfield definitions
MDCARL_CLS_POSN                          equ 0000h
MDCARL_CLS_POSITION                      equ 0000h
MDCARL_CLS_SIZE                          equ 0003h
MDCARL_CLS_LENGTH                        equ 0003h
MDCARL_CLS_MASK                          equ 0007h
MDCARL_MDCLS_POSN                        equ 0000h
MDCARL_MDCLS_POSITION                    equ 0000h
MDCARL_MDCLS_SIZE                        equ 0003h
MDCARL_MDCLS_LENGTH                      equ 0003h
MDCARL_MDCLS_MASK                        equ 0007h
MDCARL_MDCLS0_POSN                       equ 0000h
MDCARL_MDCLS0_POSITION                   equ 0000h
MDCARL_MDCLS0_SIZE                       equ 0001h
MDCARL_MDCLS0_LENGTH                     equ 0001h
MDCARL_MDCLS0_MASK                       equ 0001h
MDCARL_MDCLS1_POSN                       equ 0001h
MDCARL_MDCLS1_POSITION                   equ 0001h
MDCARL_MDCLS1_SIZE                       equ 0001h
MDCARL_MDCLS1_LENGTH                     equ 0001h
MDCARL_MDCLS1_MASK                       equ 0002h
MDCARL_MDCLS2_POSN                       equ 0002h
MDCARL_MDCLS2_POSITION                   equ 0002h
MDCARL_MDCLS2_SIZE                       equ 0001h
MDCARL_MDCLS2_LENGTH                     equ 0001h
MDCARL_MDCLS2_MASK                       equ 0004h
MDCARL_CLS0_POSN                         equ 0000h
MDCARL_CLS0_POSITION                     equ 0000h
MDCARL_CLS0_SIZE                         equ 0001h
MDCARL_CLS0_LENGTH                       equ 0001h
MDCARL_CLS0_MASK                         equ 0001h
MDCARL_CLS1_POSN                         equ 0001h
MDCARL_CLS1_POSITION                     equ 0001h
MDCARL_CLS1_SIZE                         equ 0001h
MDCARL_CLS1_LENGTH                       equ 0001h
MDCARL_CLS1_MASK                         equ 0002h
MDCARL_CLS2_POSN                         equ 0002h
MDCARL_CLS2_POSITION                     equ 0002h
MDCARL_CLS2_SIZE                         equ 0001h
MDCARL_CLS2_LENGTH                       equ 0001h
MDCARL_CLS2_MASK                         equ 0004h

// Register: MDCARH
#define MDCARH MDCARH
MDCARH                                   equ 0F50h
// bitfield definitions
MDCARH_CHS_POSN                          equ 0000h
MDCARH_CHS_POSITION                      equ 0000h
MDCARH_CHS_SIZE                          equ 0003h
MDCARH_CHS_LENGTH                        equ 0003h
MDCARH_CHS_MASK                          equ 0007h
MDCARH_CHS0_POSN                         equ 0000h
MDCARH_CHS0_POSITION                     equ 0000h
MDCARH_CHS0_SIZE                         equ 0001h
MDCARH_CHS0_LENGTH                       equ 0001h
MDCARH_CHS0_MASK                         equ 0001h
MDCARH_CHS1_POSN                         equ 0001h
MDCARH_CHS1_POSITION                     equ 0001h
MDCARH_CHS1_SIZE                         equ 0001h
MDCARH_CHS1_LENGTH                       equ 0001h
MDCARH_CHS1_MASK                         equ 0002h
MDCARH_CHS2_POSN                         equ 0002h
MDCARH_CHS2_POSITION                     equ 0002h
MDCARH_CHS2_SIZE                         equ 0001h
MDCARH_CHS2_LENGTH                       equ 0001h
MDCARH_CHS2_MASK                         equ 0004h
MDCARH_MDCHS_POSN                        equ 0000h
MDCARH_MDCHS_POSITION                    equ 0000h
MDCARH_MDCHS_SIZE                        equ 0003h
MDCARH_MDCHS_LENGTH                      equ 0003h
MDCARH_MDCHS_MASK                        equ 0007h
MDCARH_MDCHS0_POSN                       equ 0000h
MDCARH_MDCHS0_POSITION                   equ 0000h
MDCARH_MDCHS0_SIZE                       equ 0001h
MDCARH_MDCHS0_LENGTH                     equ 0001h
MDCARH_MDCHS0_MASK                       equ 0001h
MDCARH_MDCHS1_POSN                       equ 0001h
MDCARH_MDCHS1_POSITION                   equ 0001h
MDCARH_MDCHS1_SIZE                       equ 0001h
MDCARH_MDCHS1_LENGTH                     equ 0001h
MDCARH_MDCHS1_MASK                       equ 0002h
MDCARH_MDCHS2_POSN                       equ 0002h
MDCARH_MDCHS2_POSITION                   equ 0002h
MDCARH_MDCHS2_SIZE                       equ 0001h
MDCARH_MDCHS2_LENGTH                     equ 0001h
MDCARH_MDCHS2_MASK                       equ 0004h

