GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 0F78h
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0004h
CRCCON1_PLEN_LENGTH                      equ 0004h
CRCCON1_PLEN_MASK                        equ 000Fh
CRCCON1_DLEN_POSN                        equ 0004h
CRCCON1_DLEN_POSITION                    equ 0004h
CRCCON1_DLEN_SIZE                        equ 0004h
CRCCON1_DLEN_LENGTH                      equ 0004h
CRCCON1_DLEN_MASK                        equ 00F0h
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_DLEN0_POSN                       equ 0004h
CRCCON1_DLEN0_POSITION                   equ 0004h
CRCCON1_DLEN0_SIZE                       equ 0001h
CRCCON1_DLEN0_LENGTH                     equ 0001h
CRCCON1_DLEN0_MASK                       equ 0010h
CRCCON1_DLEN1_POSN                       equ 0005h
CRCCON1_DLEN1_POSITION                   equ 0005h
CRCCON1_DLEN1_SIZE                       equ 0001h
CRCCON1_DLEN1_LENGTH                     equ 0001h
CRCCON1_DLEN1_MASK                       equ 0020h
CRCCON1_DLEN2_POSN                       equ 0006h
CRCCON1_DLEN2_POSITION                   equ 0006h
CRCCON1_DLEN2_SIZE                       equ 0001h
CRCCON1_DLEN2_LENGTH                     equ 0001h
CRCCON1_DLEN2_MASK                       equ 0040h
CRCCON1_DLEN3_POSN                       equ 0007h
CRCCON1_DLEN3_POSITION                   equ 0007h
CRCCON1_DLEN3_SIZE                       equ 0001h
CRCCON1_DLEN3_LENGTH                     equ 0001h
CRCCON1_DLEN3_MASK                       equ 0080h

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 0F79h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 0F79h
// bitfield definitions
NVMADRL_NVMADRL_POSN                     equ 0000h
NVMADRL_NVMADRL_POSITION                 equ 0000h
NVMADRL_NVMADRL_SIZE                     equ 0008h
NVMADRL_NVMADRL_LENGTH                   equ 0008h
NVMADRL_NVMADRL_MASK                     equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 0F7Ah
// bitfield definitions
NVMADRH_NVMADRH_POSN                     equ 0000h
NVMADRH_NVMADRH_POSITION                 equ 0000h
NVMADRH_NVMADRH_SIZE                     equ 0008h
NVMADRH_NVMADRH_LENGTH                   equ 0008h
NVMADRH_NVMADRH_MASK                     equ 00FFh
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h
NVMADRH_NVMADR10_POSN                    equ 0002h
NVMADRH_NVMADR10_POSITION                equ 0002h
NVMADRH_NVMADR10_SIZE                    equ 0001h
NVMADRH_NVMADR10_LENGTH                  equ 0001h
NVMADRH_NVMADR10_MASK                    equ 0004h
NVMADRH_NVMADR11_POSN                    equ 0003h
NVMADRH_NVMADR11_POSITION                equ 0003h
NVMADRH_NVMADR11_SIZE                    equ 0001h
NVMADRH_NVMADR11_LENGTH                  equ 0001h
NVMADRH_NVMADR11_MASK                    equ 0008h
NVMADRH_NVMADR12_POSN                    equ 0004h
NVMADRH_NVMADR12_POSITION                equ 0004h
NVMADRH_NVMADR12_SIZE                    equ 0001h
NVMADRH_NVMADR12_LENGTH                  equ 0001h
NVMADRH_NVMADR12_MASK                    equ 0010h
NVMADRH_NVMADR13_POSN                    equ 0005h
NVMADRH_NVMADR13_POSITION                equ 0005h
NVMADRH_NVMADR13_SIZE                    equ 0001h
NVMADRH_NVMADR13_LENGTH                  equ 0001h
NVMADRH_NVMADR13_MASK                    equ 0020h
NVMADRH_NVMADR14_POSN                    equ 0006h
NVMADRH_NVMADR14_POSITION                equ 0006h
NVMADRH_NVMADR14_SIZE                    equ 0001h
NVMADRH_NVMADR14_LENGTH                  equ 0001h
NVMADRH_NVMADR14_MASK                    equ 0040h
NVMADRH_NVMADR15_POSN                    equ 0007h
NVMADRH_NVMADR15_POSITION                equ 0007h
NVMADRH_NVMADR15_SIZE                    equ 0001h
NVMADRH_NVMADR15_LENGTH                  equ 0001h
NVMADRH_NVMADR15_MASK                    equ 0080h

// Register: NVMADRU
#define NVMADRU NVMADRU
NVMADRU                                  equ 0F7Bh
// bitfield definitions
NVMADRU_NVMADRU_POSN                     equ 0000h
NVMADRU_NVMADRU_POSITION                 equ 0000h
NVMADRU_NVMADRU_SIZE                     equ 0006h
NVMADRU_NVMADRU_LENGTH                   equ 0006h
NVMADRU_NVMADRU_MASK                     equ 003Fh
NVMADRU_NVMADR16_POSN                    equ 0000h
NVMADRU_NVMADR16_POSITION                equ 0000h
NVMADRU_NVMADR16_SIZE                    equ 0001h
NVMADRU_NVMADR16_LENGTH                  equ 0001h
NVMADRU_NVMADR16_MASK                    equ 0001h
NVMADRU_NVMADR17_POSN                    equ 0001h
NVMADRU_NVMADR17_POSITION                equ 0001h
NVMADRU_NVMADR17_SIZE                    equ 0001h
NVMADRU_NVMADR17_LENGTH                  equ 0001h
NVMADRU_NVMADR17_MASK                    equ 0002h
NVMADRU_NVMADR18_POSN                    equ 0002h
NVMADRU_NVMADR18_POSITION                equ 0002h
NVMADRU_NVMADR18_SIZE                    equ 0001h
NVMADRU_NVMADR18_LENGTH                  equ 0001h
NVMADRU_NVMADR18_MASK                    equ 0004h
NVMADRU_NVMADR19_POSN                    equ 0003h
NVMADRU_NVMADR19_POSITION                equ 0003h
NVMADRU_NVMADR19_SIZE                    equ 0001h
NVMADRU_NVMADR19_LENGTH                  equ 0001h
NVMADRU_NVMADR19_MASK                    equ 0008h
NVMADRU_NVMADR20_POSN                    equ 0004h
NVMADRU_NVMADR20_POSITION                equ 0004h
NVMADRU_NVMADR20_SIZE                    equ 0001h
NVMADRU_NVMADR20_LENGTH                  equ 0001h
NVMADRU_NVMADR20_MASK                    equ 0010h
NVMADRU_NVMADR21_POSN                    equ 0005h
NVMADRU_NVMADR21_POSITION                equ 0005h
NVMADRU_NVMADR21_SIZE                    equ 0001h
NVMADRU_NVMADR21_LENGTH                  equ 0001h
NVMADRU_NVMADR21_MASK                    equ 0020h

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 0F7Ch

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 0F7Ch
// bitfield definitions
NVMDATL_NVMDATL_POSN                     equ 0000h
NVMDATL_NVMDATL_POSITION                 equ 0000h
NVMDATL_NVMDATL_SIZE                     equ 0008h
NVMDATL_NVMDATL_LENGTH                   equ 0008h
NVMDATL_NVMDATL_MASK                     equ 00FFh
NVMDATL_NVMDAT0_POSN                     equ 0000h
NVMDATL_NVMDAT0_POSITION                 equ 0000h
NVMDATL_NVMDAT0_SIZE                     equ 0001h
NVMDATL_NVMDAT0_LENGTH                   equ 0001h
NVMDATL_NVMDAT0_MASK                     equ 0001h
NVMDATL_NVMDAT1_POSN                     equ 0001h
NVMDATL_NVMDAT1_POSITION                 equ 0001h
NVMDATL_NVMDAT1_SIZE                     equ 0001h
NVMDATL_NVMDAT1_LENGTH                   equ 0001h
NVMDATL_NVMDAT1_MASK                     equ 0002h
NVMDATL_NVMDAT2_POSN                     equ 0002h
NVMDATL_NVMDAT2_POSITION                 equ 0002h
NVMDATL_NVMDAT2_SIZE                     equ 0001h
NVMDATL_NVMDAT2_LENGTH                   equ 0001h
NVMDATL_NVMDAT2_MASK                     equ 0004h
NVMDATL_NVMDAT3_POSN                     equ 0003h
NVMDATL_NVMDAT3_POSITION                 equ 0003h
NVMDATL_NVMDAT3_SIZE                     equ 0001h
NVMDATL_NVMDAT3_LENGTH                   equ 0001h
NVMDATL_NVMDAT3_MASK                     equ 0008h
NVMDATL_NVMDAT4_POSN                     equ 0004h
NVMDATL_NVMDAT4_POSITION                 equ 0004h
NVMDATL_NVMDAT4_SIZE                     equ 0001h
NVMDATL_NVMDAT4_LENGTH                   equ 0001h
NVMDATL_NVMDAT4_MASK                     equ 0010h
NVMDATL_NVMDAT5_POSN                     equ 0005h
NVMDATL_NVMDAT5_POSITION                 equ 0005h
NVMDATL_NVMDAT5_SIZE                     equ 0001h
NVMDATL_NVMDAT5_LENGTH                   equ 0001h
NVMDATL_NVMDAT5_MASK                     equ 0020h
NVMDATL_NVMDAT6_POSN                     equ 0006h
NVMDATL_NVMDAT6_POSITION                 equ 0006h
NVMDATL_NVMDAT6_SIZE                     equ 0001h
NVMDATL_NVMDAT6_LENGTH                   equ 0001h
NVMDATL_NVMDAT6_MASK                     equ 0040h
NVMDATL_NVMDAT7_POSN                     equ 0007h
NVMDATL_NVMDAT7_POSITION                 equ 0007h
NVMDATL_NVMDAT7_SIZE                     equ 0001h
NVMDATL_NVMDAT7_LENGTH                   equ 0001h
NVMDATL_NVMDAT7_MASK                     equ 0080h

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 0F7Dh
// bitfield definitions
NVMDATH_NVMDATH_POSN                     equ 0000h
NVMDATH_NVMDATH_POSITION                 equ 0000h
NVMDATH_NVMDATH_SIZE                     equ 0008h
NVMDATH_NVMDATH_LENGTH                   equ 0008h
NVMDATH_NVMDATH_MASK                     equ 00FFh
NVMDATH_NVMDAT8_POSN                     equ 0000h
NVMDATH_NVMDAT8_POSITION                 equ 0000h
NVMDATH_NVMDAT8_SIZE                     equ 0001h
NVMDATH_NVMDAT8_LENGTH                   equ 0001h
NVMDATH_NVMDAT8_MASK                     equ 0001h
NVMDATH_NVMDAT9_POSN                     equ 0001h
NVMDATH_NVMDAT9_POSITION                 equ 0001h
NVMDATH_NVMDAT9_SIZE                     equ 0001h
NVMDATH_NVMDAT9_LENGTH                   equ 0001h
NVMDATH_NVMDAT9_MASK                     equ 0002h
NVMDATH_NVMDAT10_POSN                    equ 0002h
NVMDATH_NVMDAT10_POSITION                equ 0002h
NVMDATH_NVMDAT10_SIZE                    equ 0001h
NVMDATH_NVMDAT10_LENGTH                  equ 0001h
NVMDATH_NVMDAT10_MASK                    equ 0004h
NVMDATH_NVMDAT11_POSN                    equ 0003h
NVMDATH_NVMDAT11_POSITION                equ 0003h
NVMDATH_NVMDAT11_SIZE                    equ 0001h
NVMDATH_NVMDAT11_LENGTH                  equ 0001h
NVMDATH_NVMDAT11_MASK                    equ 0008h
NVMDATH_NVMDAT12_POSN                    equ 0004h
NVMDATH_NVMDAT12_POSITION                equ 0004h
NVMDATH_NVMDAT12_SIZE                    equ 0001h
NVMDATH_NVMDAT12_LENGTH                  equ 0001h
NVMDATH_NVMDAT12_MASK                    equ 0010h
NVMDATH_NVMDAT13_POSN                    equ 0005h
NVMDATH_NVMDAT13_POSITION                equ 0005h
NVMDATH_NVMDAT13_SIZE                    equ 0001h
NVMDATH_NVMDAT13_LENGTH                  equ 0001h
NVMDATH_NVMDAT13_MASK                    equ 0020h
NVMDATH_NVMDAT14_POSN                    equ 0006h
NVMDATH_NVMDAT14_POSITION                equ 0006h
NVMDATH_NVMDAT14_SIZE                    equ 0001h
NVMDATH_NVMDAT14_LENGTH                  equ 0001h
NVMDATH_NVMDAT14_MASK                    equ 0040h
NVMDATH_NVMDAT15_POSN                    equ 0007h
NVMDATH_NVMDAT15_POSITION                equ 0007h
NVMDATH_NVMDAT15_SIZE                    equ 0001h
NVMDATH_NVMDAT15_LENGTH                  equ 0001h
NVMDATH_NVMDAT15_MASK                    equ 0080h

// Register: NVMCON0
#define NVMCON0 NVMCON0
NVMCON0                                  equ 0F7Fh
// bitfield definitions
NVMCON0_NVMERR_POSN                      equ 0004h
NVMCON0_NVMERR_POSITION                  equ 0004h
NVMCON0_NVMERR_SIZE                      equ 0001h
NVMCON0_NVMERR_LENGTH                    equ 0001h
NVMCON0_NVMERR_MASK                      equ 0010h
NVMCON0_NVMEN_POSN                       equ 0007h
NVMCON0_NVMEN_POSITION                   equ 0007h
NVMCON0_NVMEN_SIZE                       equ 0001h
NVMCON0_NVMEN_LENGTH                     equ 0001h
NVMCON0_NVMEN_MASK                       equ 0080h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 0F80h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_SECRD_POSN                       equ 0001h
NVMCON1_SECRD_POSITION                   equ 0001h
NVMCON1_SECRD_SIZE                       equ 0001h
NVMCON1_SECRD_LENGTH                     equ 0001h
NVMCON1_SECRD_MASK                       equ 0002h
NVMCON1_WR_POSN                          equ 0004h
NVMCON1_WR_POSITION                      equ 0004h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0010h
NVMCON1_SECWR_POSN                       equ 0005h
NVMCON1_SECWR_POSITION                   equ 0005h
NVMCON1_SECWR_SIZE                       equ 0001h
NVMCON1_SECWR_LENGTH                     equ 0001h
NVMCON1_SECWR_MASK                       equ 0020h
NVMCON1_SECER_POSN                       equ 0006h
NVMCON1_SECER_POSITION                   equ 0006h
NVMCON1_SECER_SIZE                       equ 0001h
NVMCON1_SECER_LENGTH                     equ 0001h
NVMCON1_SECER_MASK                       equ 0040h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 0F81h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

