GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
// Register: TMR5L
#define TMR5L TMR5L
TMR5L                                    equ 0FC0h
// bitfield definitions
TMR5L_TMR5L0_POSN                        equ 0000h
TMR5L_TMR5L0_POSITION                    equ 0000h
TMR5L_TMR5L0_SIZE                        equ 0001h
TMR5L_TMR5L0_LENGTH                      equ 0001h
TMR5L_TMR5L0_MASK                        equ 0001h
TMR5L_TMR5L1_POSN                        equ 0001h
TMR5L_TMR5L1_POSITION                    equ 0001h
TMR5L_TMR5L1_SIZE                        equ 0001h
TMR5L_TMR5L1_LENGTH                      equ 0001h
TMR5L_TMR5L1_MASK                        equ 0002h
TMR5L_TMR5L2_POSN                        equ 0002h
TMR5L_TMR5L2_POSITION                    equ 0002h
TMR5L_TMR5L2_SIZE                        equ 0001h
TMR5L_TMR5L2_LENGTH                      equ 0001h
TMR5L_TMR5L2_MASK                        equ 0004h
TMR5L_TMR5L3_POSN                        equ 0003h
TMR5L_TMR5L3_POSITION                    equ 0003h
TMR5L_TMR5L3_SIZE                        equ 0001h
TMR5L_TMR5L3_LENGTH                      equ 0001h
TMR5L_TMR5L3_MASK                        equ 0008h
TMR5L_TMR5L4_POSN                        equ 0004h
TMR5L_TMR5L4_POSITION                    equ 0004h
TMR5L_TMR5L4_SIZE                        equ 0001h
TMR5L_TMR5L4_LENGTH                      equ 0001h
TMR5L_TMR5L4_MASK                        equ 0010h
TMR5L_TMR5L5_POSN                        equ 0005h
TMR5L_TMR5L5_POSITION                    equ 0005h
TMR5L_TMR5L5_SIZE                        equ 0001h
TMR5L_TMR5L5_LENGTH                      equ 0001h
TMR5L_TMR5L5_MASK                        equ 0020h
TMR5L_TMR5L6_POSN                        equ 0006h
TMR5L_TMR5L6_POSITION                    equ 0006h
TMR5L_TMR5L6_SIZE                        equ 0001h
TMR5L_TMR5L6_LENGTH                      equ 0001h
TMR5L_TMR5L6_MASK                        equ 0040h
TMR5L_TMR5L7_POSN                        equ 0007h
TMR5L_TMR5L7_POSITION                    equ 0007h
TMR5L_TMR5L7_SIZE                        equ 0001h
TMR5L_TMR5L7_LENGTH                      equ 0001h
TMR5L_TMR5L7_MASK                        equ 0080h
TMR5L_TMR5L_POSN                         equ 0000h
TMR5L_TMR5L_POSITION                     equ 0000h
TMR5L_TMR5L_SIZE                         equ 0008h
TMR5L_TMR5L_LENGTH                       equ 0008h
TMR5L_TMR5L_MASK                         equ 00FFh
TMR5L_TMR50_POSN                         equ 0000h
TMR5L_TMR50_POSITION                     equ 0000h
TMR5L_TMR50_SIZE                         equ 0001h
TMR5L_TMR50_LENGTH                       equ 0001h
TMR5L_TMR50_MASK                         equ 0001h
TMR5L_TMR51_POSN                         equ 0001h
TMR5L_TMR51_POSITION                     equ 0001h
TMR5L_TMR51_SIZE                         equ 0001h
TMR5L_TMR51_LENGTH                       equ 0001h
TMR5L_TMR51_MASK                         equ 0002h
TMR5L_TMR52_POSN                         equ 0002h
TMR5L_TMR52_POSITION                     equ 0002h
TMR5L_TMR52_SIZE                         equ 0001h
TMR5L_TMR52_LENGTH                       equ 0001h
TMR5L_TMR52_MASK                         equ 0004h
TMR5L_TMR53_POSN                         equ 0003h
TMR5L_TMR53_POSITION                     equ 0003h
TMR5L_TMR53_SIZE                         equ 0001h
TMR5L_TMR53_LENGTH                       equ 0001h
TMR5L_TMR53_MASK                         equ 0008h
TMR5L_TMR54_POSN                         equ 0004h
TMR5L_TMR54_POSITION                     equ 0004h
TMR5L_TMR54_SIZE                         equ 0001h
TMR5L_TMR54_LENGTH                       equ 0001h
TMR5L_TMR54_MASK                         equ 0010h
TMR5L_TMR55_POSN                         equ 0005h
TMR5L_TMR55_POSITION                     equ 0005h
TMR5L_TMR55_SIZE                         equ 0001h
TMR5L_TMR55_LENGTH                       equ 0001h
TMR5L_TMR55_MASK                         equ 0020h
TMR5L_TMR56_POSN                         equ 0006h
TMR5L_TMR56_POSITION                     equ 0006h
TMR5L_TMR56_SIZE                         equ 0001h
TMR5L_TMR56_LENGTH                       equ 0001h
TMR5L_TMR56_MASK                         equ 0040h
TMR5L_TMR57_POSN                         equ 0007h
TMR5L_TMR57_POSITION                     equ 0007h
TMR5L_TMR57_SIZE                         equ 0001h
TMR5L_TMR57_LENGTH                       equ 0001h
TMR5L_TMR57_MASK                         equ 0080h
TMR5L_CAL05_POSN                         equ 0000h
TMR5L_CAL05_POSITION                     equ 0000h
TMR5L_CAL05_SIZE                         equ 0001h
TMR5L_CAL05_LENGTH                       equ 0001h
TMR5L_CAL05_MASK                         equ 0001h
TMR5L_CAL15_POSN                         equ 0001h
TMR5L_CAL15_POSITION                     equ 0001h
TMR5L_CAL15_SIZE                         equ 0001h
TMR5L_CAL15_LENGTH                       equ 0001h
TMR5L_CAL15_MASK                         equ 0002h
TMR5L_CAL25_POSN                         equ 0002h
TMR5L_CAL25_POSITION                     equ 0002h
TMR5L_CAL25_SIZE                         equ 0001h
TMR5L_CAL25_LENGTH                       equ 0001h
TMR5L_CAL25_MASK                         equ 0004h
TMR5L_CAL35_POSN                         equ 0003h
TMR5L_CAL35_POSITION                     equ 0003h
TMR5L_CAL35_SIZE                         equ 0001h
TMR5L_CAL35_LENGTH                       equ 0001h
TMR5L_CAL35_MASK                         equ 0008h
TMR5L_CAL45_POSN                         equ 0004h
TMR5L_CAL45_POSITION                     equ 0004h
TMR5L_CAL45_SIZE                         equ 0001h
TMR5L_CAL45_LENGTH                       equ 0001h
TMR5L_CAL45_MASK                         equ 0010h
TMR5L_CAL55_POSN                         equ 0005h
TMR5L_CAL55_POSITION                     equ 0005h
TMR5L_CAL55_SIZE                         equ 0001h
TMR5L_CAL55_LENGTH                       equ 0001h
TMR5L_CAL55_MASK                         equ 0020h
TMR5L_CAL65_POSN                         equ 0006h
TMR5L_CAL65_POSITION                     equ 0006h
TMR5L_CAL65_SIZE                         equ 0001h
TMR5L_CAL65_LENGTH                       equ 0001h
TMR5L_CAL65_MASK                         equ 0040h
TMR5L_CAL75_POSN                         equ 0007h
TMR5L_CAL75_POSITION                     equ 0007h
TMR5L_CAL75_SIZE                         equ 0001h
TMR5L_CAL75_LENGTH                       equ 0001h
TMR5L_CAL75_MASK                         equ 0080h

// Register: TMR5H
#define TMR5H TMR5H
TMR5H                                    equ 0FC1h
// bitfield definitions
TMR5H_TMR5H0_POSN                        equ 0000h
TMR5H_TMR5H0_POSITION                    equ 0000h
TMR5H_TMR5H0_SIZE                        equ 0001h
TMR5H_TMR5H0_LENGTH                      equ 0001h
TMR5H_TMR5H0_MASK                        equ 0001h
TMR5H_TMR5H1_POSN                        equ 0001h
TMR5H_TMR5H1_POSITION                    equ 0001h
TMR5H_TMR5H1_SIZE                        equ 0001h
TMR5H_TMR5H1_LENGTH                      equ 0001h
TMR5H_TMR5H1_MASK                        equ 0002h
TMR5H_TMR5H2_POSN                        equ 0002h
TMR5H_TMR5H2_POSITION                    equ 0002h
TMR5H_TMR5H2_SIZE                        equ 0001h
TMR5H_TMR5H2_LENGTH                      equ 0001h
TMR5H_TMR5H2_MASK                        equ 0004h
TMR5H_TMR5H3_POSN                        equ 0003h
TMR5H_TMR5H3_POSITION                    equ 0003h
TMR5H_TMR5H3_SIZE                        equ 0001h
TMR5H_TMR5H3_LENGTH                      equ 0001h
TMR5H_TMR5H3_MASK                        equ 0008h
TMR5H_TMR5H4_POSN                        equ 0004h
TMR5H_TMR5H4_POSITION                    equ 0004h
TMR5H_TMR5H4_SIZE                        equ 0001h
TMR5H_TMR5H4_LENGTH                      equ 0001h
TMR5H_TMR5H4_MASK                        equ 0010h
TMR5H_TMR5H5_POSN                        equ 0005h
TMR5H_TMR5H5_POSITION                    equ 0005h
TMR5H_TMR5H5_SIZE                        equ 0001h
TMR5H_TMR5H5_LENGTH                      equ 0001h
TMR5H_TMR5H5_MASK                        equ 0020h
TMR5H_TMR5H6_POSN                        equ 0006h
TMR5H_TMR5H6_POSITION                    equ 0006h
TMR5H_TMR5H6_SIZE                        equ 0001h
TMR5H_TMR5H6_LENGTH                      equ 0001h
TMR5H_TMR5H6_MASK                        equ 0040h
TMR5H_TMR5H7_POSN                        equ 0007h
TMR5H_TMR5H7_POSITION                    equ 0007h
TMR5H_TMR5H7_SIZE                        equ 0001h
TMR5H_TMR5H7_LENGTH                      equ 0001h
TMR5H_TMR5H7_MASK                        equ 0080h
TMR5H_TMR5H_POSN                         equ 0000h
TMR5H_TMR5H_POSITION                     equ 0000h
TMR5H_TMR5H_SIZE                         equ 0008h
TMR5H_TMR5H_LENGTH                       equ 0008h
TMR5H_TMR5H_MASK                         equ 00FFh
TMR5H_TMR58_POSN                         equ 0000h
TMR5H_TMR58_POSITION                     equ 0000h
TMR5H_TMR58_SIZE                         equ 0001h
TMR5H_TMR58_LENGTH                       equ 0001h
TMR5H_TMR58_MASK                         equ 0001h
TMR5H_TMR59_POSN                         equ 0001h
TMR5H_TMR59_POSITION                     equ 0001h
TMR5H_TMR59_SIZE                         equ 0001h
TMR5H_TMR59_LENGTH                       equ 0001h
TMR5H_TMR59_MASK                         equ 0002h
TMR5H_TMR510_POSN                        equ 0002h
TMR5H_TMR510_POSITION                    equ 0002h
TMR5H_TMR510_SIZE                        equ 0001h
TMR5H_TMR510_LENGTH                      equ 0001h
TMR5H_TMR510_MASK                        equ 0004h
TMR5H_TMR511_POSN                        equ 0003h
TMR5H_TMR511_POSITION                    equ 0003h
TMR5H_TMR511_SIZE                        equ 0001h
TMR5H_TMR511_LENGTH                      equ 0001h
TMR5H_TMR511_MASK                        equ 0008h
TMR5H_TMR512_POSN                        equ 0004h
TMR5H_TMR512_POSITION                    equ 0004h
TMR5H_TMR512_SIZE                        equ 0001h
TMR5H_TMR512_LENGTH                      equ 0001h
TMR5H_TMR512_MASK                        equ 0010h
TMR5H_TMR513_POSN                        equ 0005h
TMR5H_TMR513_POSITION                    equ 0005h
TMR5H_TMR513_SIZE                        equ 0001h
TMR5H_TMR513_LENGTH                      equ 0001h
TMR5H_TMR513_MASK                        equ 0020h
TMR5H_TMR514_POSN                        equ 0006h
TMR5H_TMR514_POSITION                    equ 0006h
TMR5H_TMR514_SIZE                        equ 0001h
TMR5H_TMR514_LENGTH                      equ 0001h
TMR5H_TMR514_MASK                        equ 0040h
TMR5H_TMR515_POSN                        equ 0007h
TMR5H_TMR515_POSITION                    equ 0007h
TMR5H_TMR515_SIZE                        equ 0001h
TMR5H_TMR515_LENGTH                      equ 0001h
TMR5H_TMR515_MASK                        equ 0080h

// Register: T5CON
#define T5CON T5CON
T5CON                                    equ 0FC2h
// bitfield definitions
T5CON_NOT_SYNC_POSN                      equ 0002h
T5CON_NOT_SYNC_POSITION                  equ 0002h
T5CON_NOT_SYNC_SIZE                      equ 0001h
T5CON_NOT_SYNC_LENGTH                    equ 0001h
T5CON_NOT_SYNC_MASK                      equ 0004h
T5CON_ON_POSN                            equ 0000h
T5CON_ON_POSITION                        equ 0000h
T5CON_ON_SIZE                            equ 0001h
T5CON_ON_LENGTH                          equ 0001h
T5CON_ON_MASK                            equ 0001h
T5CON_RD16_POSN                          equ 0001h
T5CON_RD16_POSITION                      equ 0001h
T5CON_RD16_SIZE                          equ 0001h
T5CON_RD16_LENGTH                        equ 0001h
T5CON_RD16_MASK                          equ 0002h
T5CON_nSYNC_POSN                         equ 0002h
T5CON_nSYNC_POSITION                     equ 0002h
T5CON_nSYNC_SIZE                         equ 0001h
T5CON_nSYNC_LENGTH                       equ 0001h
T5CON_nSYNC_MASK                         equ 0004h
T5CON_CKPS_POSN                          equ 0004h
T5CON_CKPS_POSITION                      equ 0004h
T5CON_CKPS_SIZE                          equ 0002h
T5CON_CKPS_LENGTH                        equ 0002h
T5CON_CKPS_MASK                          equ 0030h
T5CON_NOT_T5SYNC_POSN                    equ 0002h
T5CON_NOT_T5SYNC_POSITION                equ 0002h
T5CON_NOT_T5SYNC_SIZE                    equ 0001h
T5CON_NOT_T5SYNC_LENGTH                  equ 0001h
T5CON_NOT_T5SYNC_MASK                    equ 0004h
T5CON_TMR5ON_POSN                        equ 0000h
T5CON_TMR5ON_POSITION                    equ 0000h
T5CON_TMR5ON_SIZE                        equ 0001h
T5CON_TMR5ON_LENGTH                      equ 0001h
T5CON_TMR5ON_MASK                        equ 0001h
T5CON_T5RD16_POSN                        equ 0001h
T5CON_T5RD16_POSITION                    equ 0001h
T5CON_T5RD16_SIZE                        equ 0001h
T5CON_T5RD16_LENGTH                      equ 0001h
T5CON_T5RD16_MASK                        equ 0002h
T5CON_nT5SYNC_POSN                       equ 0002h
T5CON_nT5SYNC_POSITION                   equ 0002h
T5CON_nT5SYNC_SIZE                       equ 0001h
T5CON_nT5SYNC_LENGTH                     equ 0001h
T5CON_nT5SYNC_MASK                       equ 0004h
T5CON_T5CKPS0_POSN                       equ 0004h
T5CON_T5CKPS0_POSITION                   equ 0004h
T5CON_T5CKPS0_SIZE                       equ 0001h
T5CON_T5CKPS0_LENGTH                     equ 0001h
T5CON_T5CKPS0_MASK                       equ 0010h
T5CON_T5CKPS1_POSN                       equ 0005h
T5CON_T5CKPS1_POSITION                   equ 0005h
T5CON_T5CKPS1_SIZE                       equ 0001h
T5CON_T5CKPS1_LENGTH                     equ 0001h
T5CON_T5CKPS1_MASK                       equ 0020h
T5CON_CKPS0_POSN                         equ 0004h
T5CON_CKPS0_POSITION                     equ 0004h
T5CON_CKPS0_SIZE                         equ 0001h
T5CON_CKPS0_LENGTH                       equ 0001h
T5CON_CKPS0_MASK                         equ 0010h
T5CON_CKPS1_POSN                         equ 0005h
T5CON_CKPS1_POSITION                     equ 0005h
T5CON_CKPS1_SIZE                         equ 0001h
T5CON_CKPS1_LENGTH                       equ 0001h
T5CON_CKPS1_MASK                         equ 0020h
T5CON_RD165_POSN                         equ 0001h
T5CON_RD165_POSITION                     equ 0001h
T5CON_RD165_SIZE                         equ 0001h
T5CON_RD165_LENGTH                       equ 0001h
T5CON_RD165_MASK                         equ 0002h

// Register: T5GCON
#define T5GCON T5GCON
T5GCON                                   equ 0FC3h
// bitfield definitions
T5GCON_GGO_NOT_DONE_POSN                 equ 0003h
T5GCON_GGO_NOT_DONE_POSITION             equ 0003h
T5GCON_GGO_NOT_DONE_SIZE                 equ 0001h
T5GCON_GGO_NOT_DONE_LENGTH               equ 0001h
T5GCON_GGO_NOT_DONE_MASK                 equ 0008h
T5GCON_GVAL_POSN                         equ 0002h
T5GCON_GVAL_POSITION                     equ 0002h
T5GCON_GVAL_SIZE                         equ 0001h
T5GCON_GVAL_LENGTH                       equ 0001h
T5GCON_GVAL_MASK                         equ 0004h
T5GCON_GGO_nDONE_POSN                    equ 0003h
T5GCON_GGO_nDONE_POSITION                equ 0003h
T5GCON_GGO_nDONE_SIZE                    equ 0001h
T5GCON_GGO_nDONE_LENGTH                  equ 0001h
T5GCON_GGO_nDONE_MASK                    equ 0008h
T5GCON_GSPM_POSN                         equ 0004h
T5GCON_GSPM_POSITION                     equ 0004h
T5GCON_GSPM_SIZE                         equ 0001h
T5GCON_GSPM_LENGTH                       equ 0001h
T5GCON_GSPM_MASK                         equ 0010h
T5GCON_GTM_POSN                          equ 0005h
T5GCON_GTM_POSITION                      equ 0005h
T5GCON_GTM_SIZE                          equ 0001h
T5GCON_GTM_LENGTH                        equ 0001h
T5GCON_GTM_MASK                          equ 0020h
T5GCON_GPOL_POSN                         equ 0006h
T5GCON_GPOL_POSITION                     equ 0006h
T5GCON_GPOL_SIZE                         equ 0001h
T5GCON_GPOL_LENGTH                       equ 0001h
T5GCON_GPOL_MASK                         equ 0040h
T5GCON_GE_POSN                           equ 0007h
T5GCON_GE_POSITION                       equ 0007h
T5GCON_GE_SIZE                           equ 0001h
T5GCON_GE_LENGTH                         equ 0001h
T5GCON_GE_MASK                           equ 0080h
T5GCON_T5GGO_NOT_DONE_POSN               equ 0003h
T5GCON_T5GGO_NOT_DONE_POSITION           equ 0003h
T5GCON_T5GGO_NOT_DONE_SIZE               equ 0001h
T5GCON_T5GGO_NOT_DONE_LENGTH             equ 0001h
T5GCON_T5GGO_NOT_DONE_MASK               equ 0008h
T5GCON_T5GVAL_POSN                       equ 0002h
T5GCON_T5GVAL_POSITION                   equ 0002h
T5GCON_T5GVAL_SIZE                       equ 0001h
T5GCON_T5GVAL_LENGTH                     equ 0001h
T5GCON_T5GVAL_MASK                       equ 0004h
T5GCON_T5GGO_nDONE_POSN                  equ 0003h
T5GCON_T5GGO_nDONE_POSITION              equ 0003h
T5GCON_T5GGO_nDONE_SIZE                  equ 0001h
T5GCON_T5GGO_nDONE_LENGTH                equ 0001h
T5GCON_T5GGO_nDONE_MASK                  equ 0008h
T5GCON_T5GSPM_POSN                       equ 0004h
T5GCON_T5GSPM_POSITION                   equ 0004h
T5GCON_T5GSPM_SIZE                       equ 0001h
T5GCON_T5GSPM_LENGTH                     equ 0001h
T5GCON_T5GSPM_MASK                       equ 0010h
T5GCON_T5GTM_POSN                        equ 0005h
T5GCON_T5GTM_POSITION                    equ 0005h
T5GCON_T5GTM_SIZE                        equ 0001h
T5GCON_T5GTM_LENGTH                      equ 0001h
T5GCON_T5GTM_MASK                        equ 0020h
T5GCON_T5GPOL_POSN                       equ 0006h
T5GCON_T5GPOL_POSITION                   equ 0006h
T5GCON_T5GPOL_SIZE                       equ 0001h
T5GCON_T5GPOL_LENGTH                     equ 0001h
T5GCON_T5GPOL_MASK                       equ 0040h
T5GCON_T5GE_POSN                         equ 0007h
T5GCON_T5GE_POSITION                     equ 0007h
T5GCON_T5GE_SIZE                         equ 0001h
T5GCON_T5GE_LENGTH                       equ 0001h
T5GCON_T5GE_MASK                         equ 0080h
T5GCON_T5GGO_POSN                        equ 0003h
T5GCON_T5GGO_POSITION                    equ 0003h
T5GCON_T5GGO_SIZE                        equ 0001h
T5GCON_T5GGO_LENGTH                      equ 0001h
T5GCON_T5GGO_MASK                        equ 0008h

// Register: T5GATE
#define T5GATE T5GATE
T5GATE                                   equ 0FC4h
// bitfield definitions
T5GATE_GSS_POSN                          equ 0000h
T5GATE_GSS_POSITION                      equ 0000h
T5GATE_GSS_SIZE                          equ 0005h
T5GATE_GSS_LENGTH                        equ 0005h
T5GATE_GSS_MASK                          equ 001Fh
T5GATE_GSS0_POSN                         equ 0000h
T5GATE_GSS0_POSITION                     equ 0000h
T5GATE_GSS0_SIZE                         equ 0001h
T5GATE_GSS0_LENGTH                       equ 0001h
T5GATE_GSS0_MASK                         equ 0001h
T5GATE_GSS1_POSN                         equ 0001h
T5GATE_GSS1_POSITION                     equ 0001h
T5GATE_GSS1_SIZE                         equ 0001h
T5GATE_GSS1_LENGTH                       equ 0001h
T5GATE_GSS1_MASK                         equ 0002h
T5GATE_GSS2_POSN                         equ 0002h
T5GATE_GSS2_POSITION                     equ 0002h
T5GATE_GSS2_SIZE                         equ 0001h
T5GATE_GSS2_LENGTH                       equ 0001h
T5GATE_GSS2_MASK                         equ 0004h
T5GATE_GSS3_POSN                         equ 0003h
T5GATE_GSS3_POSITION                     equ 0003h
T5GATE_GSS3_SIZE                         equ 0001h
T5GATE_GSS3_LENGTH                       equ 0001h
T5GATE_GSS3_MASK                         equ 0008h
T5GATE_T5GSS0_POSN                       equ 0000h
T5GATE_T5GSS0_POSITION                   equ 0000h
T5GATE_T5GSS0_SIZE                       equ 0001h
T5GATE_T5GSS0_LENGTH                     equ 0001h
T5GATE_T5GSS0_MASK                       equ 0001h
T5GATE_T5GSS1_POSN                       equ 0001h
T5GATE_T5GSS1_POSITION                   equ 0001h
T5GATE_T5GSS1_SIZE                       equ 0001h
T5GATE_T5GSS1_LENGTH                     equ 0001h
T5GATE_T5GSS1_MASK                       equ 0002h
T5GATE_T5GSS2_POSN                       equ 0002h
T5GATE_T5GSS2_POSITION                   equ 0002h
T5GATE_T5GSS2_SIZE                       equ 0001h
T5GATE_T5GSS2_LENGTH                     equ 0001h
T5GATE_T5GSS2_MASK                       equ 0004h
T5GATE_T5GSS3_POSN                       equ 0003h
T5GATE_T5GSS3_POSITION                   equ 0003h
T5GATE_T5GSS3_SIZE                       equ 0001h
T5GATE_T5GSS3_LENGTH                     equ 0001h
T5GATE_T5GSS3_MASK                       equ 0008h

// Register: T5CLK
#define T5CLK T5CLK
T5CLK                                    equ 0FC5h
// bitfield definitions
T5CLK_CS_POSN                            equ 0000h
T5CLK_CS_POSITION                        equ 0000h
T5CLK_CS_SIZE                            equ 0004h
T5CLK_CS_LENGTH                          equ 0004h
T5CLK_CS_MASK                            equ 000Fh
T5CLK_T5CS0_POSN                         equ 0000h
T5CLK_T5CS0_POSITION                     equ 0000h
T5CLK_T5CS0_SIZE                         equ 0001h
T5CLK_T5CS0_LENGTH                       equ 0001h
T5CLK_T5CS0_MASK                         equ 0001h
T5CLK_T5CS1_POSN                         equ 0001h
T5CLK_T5CS1_POSITION                     equ 0001h
T5CLK_T5CS1_SIZE                         equ 0001h
T5CLK_T5CS1_LENGTH                       equ 0001h
T5CLK_T5CS1_MASK                         equ 0002h
T5CLK_T5CS2_POSN                         equ 0002h
T5CLK_T5CS2_POSITION                     equ 0002h
T5CLK_T5CS2_SIZE                         equ 0001h
T5CLK_T5CS2_LENGTH                       equ 0001h
T5CLK_T5CS2_MASK                         equ 0004h
T5CLK_T5CS3_POSN                         equ 0003h
T5CLK_T5CS3_POSITION                     equ 0003h
T5CLK_T5CS3_SIZE                         equ 0001h
T5CLK_T5CS3_LENGTH                       equ 0001h
T5CLK_T5CS3_MASK                         equ 0008h
T5CLK_CS0_POSN                           equ 0000h
T5CLK_CS0_POSITION                       equ 0000h
T5CLK_CS0_SIZE                           equ 0001h
T5CLK_CS0_LENGTH                         equ 0001h
T5CLK_CS0_MASK                           equ 0001h
T5CLK_CS1_POSN                           equ 0001h
T5CLK_CS1_POSITION                       equ 0001h
T5CLK_CS1_SIZE                           equ 0001h
T5CLK_CS1_LENGTH                         equ 0001h
T5CLK_CS1_MASK                           equ 0002h
T5CLK_CS2_POSN                           equ 0002h
T5CLK_CS2_POSITION                       equ 0002h
T5CLK_CS2_SIZE                           equ 0001h
T5CLK_CS2_LENGTH                         equ 0001h
T5CLK_CS2_MASK                           equ 0004h
T5CLK_CS3_POSN                           equ 0003h
T5CLK_CS3_POSITION                       equ 0003h
T5CLK_CS3_SIZE                           equ 0001h
T5CLK_CS3_LENGTH                         equ 0001h
T5CLK_CS3_MASK                           equ 0008h

// Register: TMR3
#define TMR3 TMR3
TMR3                                     equ 0FC6h

