GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.inc
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3, b
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4, b
#define LC2D2S5                          BANKMASK(CLC2SEL1), 5, b
#define LC2D2S6                          BANKMASK(CLC2SEL1), 6, b
#define LC2D2S7                          BANKMASK(CLC2SEL1), 7, b
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0, b
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1, b
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2, b
#define LC2D3S3                          BANKMASK(CLC2SEL2), 3, b
#define LC2D3S4                          BANKMASK(CLC2SEL2), 4, b
#define LC2D3S5                          BANKMASK(CLC2SEL2), 5, b
#define LC2D3S6                          BANKMASK(CLC2SEL2), 6, b
#define LC2D3S7                          BANKMASK(CLC2SEL2), 7, b
#define LC2D4S0                          BANKMASK(CLC2SEL3), 0, b
#define LC2D4S1                          BANKMASK(CLC2SEL3), 1, b
#define LC2D4S2                          BANKMASK(CLC2SEL3), 2, b
#define LC2D4S3                          BANKMASK(CLC2SEL3), 3, b
#define LC2D4S4                          BANKMASK(CLC2SEL3), 4, b
#define LC2D4S5                          BANKMASK(CLC2SEL3), 5, b
#define LC2D4S6                          BANKMASK(CLC2SEL3), 6, b
#define LC2D4S7                          BANKMASK(CLC2SEL3), 7, b
#define LC2EN                            BANKMASK(CLC2CON), 7, b
#define LC2G1D1N                         BANKMASK(CLC2GLS0), 0, b
#define LC2G1D1T                         BANKMASK(CLC2GLS0), 1, b
#define LC2G1D2N                         BANKMASK(CLC2GLS0), 2, b
#define LC2G1D2T                         BANKMASK(CLC2GLS0), 3, b
#define LC2G1D3N                         BANKMASK(CLC2GLS0), 4, b
#define LC2G1D3T                         BANKMASK(CLC2GLS0), 5, b
#define LC2G1D4N                         BANKMASK(CLC2GLS0), 6, b
#define LC2G1D4T                         BANKMASK(CLC2GLS0), 7, b
#define LC2G1POL                         BANKMASK(CLC2POL), 0, b
#define LC2G2D1N                         BANKMASK(CLC2GLS1), 0, b
#define LC2G2D1T                         BANKMASK(CLC2GLS1), 1, b
#define LC2G2D2N                         BANKMASK(CLC2GLS1), 2, b
#define LC2G2D2T                         BANKMASK(CLC2GLS1), 3, b
#define LC2G2D3N                         BANKMASK(CLC2GLS1), 4, b
#define LC2G2D3T                         BANKMASK(CLC2GLS1), 5, b
#define LC2G2D4N                         BANKMASK(CLC2GLS1), 6, b
#define LC2G2D4T                         BANKMASK(CLC2GLS1), 7, b
#define LC2G2POL                         BANKMASK(CLC2POL), 1, b
#define LC2G3D1N                         BANKMASK(CLC2GLS2), 0, b
#define LC2G3D1T                         BANKMASK(CLC2GLS2), 1, b
#define LC2G3D2N                         BANKMASK(CLC2GLS2), 2, b
#define LC2G3D2T                         BANKMASK(CLC2GLS2), 3, b
#define LC2G3D3N                         BANKMASK(CLC2GLS2), 4, b
#define LC2G3D3T                         BANKMASK(CLC2GLS2), 5, b
#define LC2G3D4N                         BANKMASK(CLC2GLS2), 6, b
#define LC2G3D4T                         BANKMASK(CLC2GLS2), 7, b
#define LC2G3POL                         BANKMASK(CLC2POL), 2, b
#define LC2G4D1N                         BANKMASK(CLC2GLS3), 0, b
#define LC2G4D1T                         BANKMASK(CLC2GLS3), 1, b
#define LC2G4D2N                         BANKMASK(CLC2GLS3), 2, b
#define LC2G4D2T                         BANKMASK(CLC2GLS3), 3, b
#define LC2G4D3N                         BANKMASK(CLC2GLS3), 4, b
#define LC2G4D3T                         BANKMASK(CLC2GLS3), 5, b
#define LC2G4D4N                         BANKMASK(CLC2GLS3), 6, b
#define LC2G4D4T                         BANKMASK(CLC2GLS3), 7, b
#define LC2G4POL                         BANKMASK(CLC2POL), 3, b
#define LC2INTN                          BANKMASK(CLC2CON), 3, b
#define LC2INTP                          BANKMASK(CLC2CON), 4, b
#define LC2MODE0                         BANKMASK(CLC2CON), 0, b
#define LC2MODE1                         BANKMASK(CLC2CON), 1, b
#define LC2MODE2                         BANKMASK(CLC2CON), 2, b
#define LC2OUT                           BANKMASK(CLC2CON), 5, b
#define LC2POL                           BANKMASK(CLC2POL), 7, b
#define LC3D1S0                          BANKMASK(CLC3SEL0), 0, b
#define LC3D1S1                          BANKMASK(CLC3SEL0), 1, b
#define LC3D1S2                          BANKMASK(CLC3SEL0), 2, b
#define LC3D1S3                          BANKMASK(CLC3SEL0), 3, b
#define LC3D1S4                          BANKMASK(CLC3SEL0), 4, b
#define LC3D1S5                          BANKMASK(CLC3SEL0), 5, b
#define LC3D1S6                          BANKMASK(CLC3SEL0), 6, b
#define LC3D1S7                          BANKMASK(CLC3SEL0), 7, b
#define LC3D2S0                          BANKMASK(CLC3SEL1), 0, b
#define LC3D2S1                          BANKMASK(CLC3SEL1), 1, b
#define LC3D2S2                          BANKMASK(CLC3SEL1), 2, b
#define LC3D2S3                          BANKMASK(CLC3SEL1), 3, b
#define LC3D2S4                          BANKMASK(CLC3SEL1), 4, b
#define LC3D2S5                          BANKMASK(CLC3SEL1), 5, b
#define LC3D2S6                          BANKMASK(CLC3SEL1), 6, b
#define LC3D2S7                          BANKMASK(CLC3SEL1), 7, b
#define LC3D3S0                          BANKMASK(CLC3SEL2), 0, b
#define LC3D3S1                          BANKMASK(CLC3SEL2), 1, b
#define LC3D3S2                          BANKMASK(CLC3SEL2), 2, b
#define LC3D3S3                          BANKMASK(CLC3SEL2), 3, b
#define LC3D3S4                          BANKMASK(CLC3SEL2), 4, b
#define LC3D3S5                          BANKMASK(CLC3SEL2), 5, b
#define LC3D3S6                          BANKMASK(CLC3SEL2), 6, b
#define LC3D3S7                          BANKMASK(CLC3SEL2), 7, b
#define LC3D4S0                          BANKMASK(CLC3SEL3), 0, b
#define LC3D4S1                          BANKMASK(CLC3SEL3), 1, b
#define LC3D4S2                          BANKMASK(CLC3SEL3), 2, b
#define LC3D4S3                          BANKMASK(CLC3SEL3), 3, b
#define LC3D4S4                          BANKMASK(CLC3SEL3), 4, b
#define LC3D4S5                          BANKMASK(CLC3SEL3), 5, b
#define LC3D4S6                          BANKMASK(CLC3SEL3), 6, b
#define LC3D4S7                          BANKMASK(CLC3SEL3), 7, b
#define LC3EN                            BANKMASK(CLC3CON), 7, b
#define LC3G1D1N                         BANKMASK(CLC3GLS0), 0, b
#define LC3G1D1T                         BANKMASK(CLC3GLS0), 1, b
#define LC3G1D2N                         BANKMASK(CLC3GLS0), 2, b
#define LC3G1D2T                         BANKMASK(CLC3GLS0), 3, b
#define LC3G1D3N                         BANKMASK(CLC3GLS0), 4, b
#define LC3G1D3T                         BANKMASK(CLC3GLS0), 5, b
#define LC3G1D4N                         BANKMASK(CLC3GLS0), 6, b
#define LC3G1D4T                         BANKMASK(CLC3GLS0), 7, b
#define LC3G1POL                         BANKMASK(CLC3POL), 0, b
#define LC3G2D1N                         BANKMASK(CLC3GLS1), 0, b
#define LC3G2D1T                         BANKMASK(CLC3GLS1), 1, b
#define LC3G2D2N                         BANKMASK(CLC3GLS1), 2, b
#define LC3G2D2T                         BANKMASK(CLC3GLS1), 3, b
#define LC3G2D3N                         BANKMASK(CLC3GLS1), 4, b
#define LC3G2D3T                         BANKMASK(CLC3GLS1), 5, b
#define LC3G2D4N                         BANKMASK(CLC3GLS1), 6, b
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7, b
#define LC3G2POL                         BANKMASK(CLC3POL), 1, b
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0, b
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1, b
#define LC3G3D2N                         BANKMASK(CLC3GLS2), 2, b
#define LC3G3D2T                         BANKMASK(CLC3GLS2), 3, b
#define LC3G3D3N                         BANKMASK(CLC3GLS2), 4, b
#define LC3G3D3T                         BANKMASK(CLC3GLS2), 5, b
#define LC3G3D4N                         BANKMASK(CLC3GLS2), 6, b
#define LC3G3D4T                         BANKMASK(CLC3GLS2), 7, b
#define LC3G3POL                         BANKMASK(CLC3POL), 2, b
#define LC3G4D1N                         BANKMASK(CLC3GLS3), 0, b
#define LC3G4D1T                         BANKMASK(CLC3GLS3), 1, b
#define LC3G4D2N                         BANKMASK(CLC3GLS3), 2, b
#define LC3G4D2T                         BANKMASK(CLC3GLS3), 3, b
#define LC3G4D3N                         BANKMASK(CLC3GLS3), 4, b
#define LC3G4D3T                         BANKMASK(CLC3GLS3), 5, b
#define LC3G4D4N                         BANKMASK(CLC3GLS3), 6, b
#define LC3G4D4T                         BANKMASK(CLC3GLS3), 7, b
#define LC3G4POL                         BANKMASK(CLC3POL), 3, b
#define LC3INTN                          BANKMASK(CLC3CON), 3, b
#define LC3INTP                          BANKMASK(CLC3CON), 4, b
#define LC3MODE0                         BANKMASK(CLC3CON), 0, b
#define LC3MODE1                         BANKMASK(CLC3CON), 1, b
#define LC3MODE2                         BANKMASK(CLC3CON), 2, b
#define LC3OUT                           BANKMASK(CLC3CON), 5, b
#define LC3POL                           BANKMASK(CLC3POL), 7, b
#define LC4D1S0                          BANKMASK(CLC4SEL0), 0, b
#define LC4D1S1                          BANKMASK(CLC4SEL0), 1, b
#define LC4D1S2                          BANKMASK(CLC4SEL0), 2, b
#define LC4D1S3                          BANKMASK(CLC4SEL0), 3, b
#define LC4D1S4                          BANKMASK(CLC4SEL0), 4, b
#define LC4D1S5                          BANKMASK(CLC4SEL0), 5, b
#define LC4D1S6                          BANKMASK(CLC4SEL0), 6, b
#define LC4D1S7                          BANKMASK(CLC4SEL0), 7, b
#define LC4D2S0                          BANKMASK(CLC4SEL1), 0, b
#define LC4D2S1                          BANKMASK(CLC4SEL1), 1, b
#define LC4D2S2                          BANKMASK(CLC4SEL1), 2, b
#define LC4D2S3                          BANKMASK(CLC4SEL1), 3, b
#define LC4D2S4                          BANKMASK(CLC4SEL1), 4, b
#define LC4D2S5                          BANKMASK(CLC4SEL1), 5, b
#define LC4D2S6                          BANKMASK(CLC4SEL1), 6, b
#define LC4D2S7                          BANKMASK(CLC4SEL1), 7, b
#define LC4D3S0                          BANKMASK(CLC4SEL2), 0, b
#define LC4D3S1                          BANKMASK(CLC4SEL2), 1, b
#define LC4D3S2                          BANKMASK(CLC4SEL2), 2, b
#define LC4D3S3                          BANKMASK(CLC4SEL2), 3, b
#define LC4D3S4                          BANKMASK(CLC4SEL2), 4, b
#define LC4D3S5                          BANKMASK(CLC4SEL2), 5, b
#define LC4D3S6                          BANKMASK(CLC4SEL2), 6, b
#define LC4D3S7                          BANKMASK(CLC4SEL2), 7, b
#define LC4D4S0                          BANKMASK(CLC4SEL3), 0, b
#define LC4D4S1                          BANKMASK(CLC4SEL3), 1, b
#define LC4D4S2                          BANKMASK(CLC4SEL3), 2, b
#define LC4D4S3                          BANKMASK(CLC4SEL3), 3, b
#define LC4D4S4                          BANKMASK(CLC4SEL3), 4, b
#define LC4D4S5                          BANKMASK(CLC4SEL3), 5, b
#define LC4D4S6                          BANKMASK(CLC4SEL3), 6, b
#define LC4D4S7                          BANKMASK(CLC4SEL3), 7, b
#define LC4EN                            BANKMASK(CLC4CON), 7, b
#define LC4G1D1N                         BANKMASK(CLC4GLS0), 0, b
#define LC4G1D1T                         BANKMASK(CLC4GLS0), 1, b
#define LC4G1D2N                         BANKMASK(CLC4GLS0), 2, b
#define LC4G1D2T                         BANKMASK(CLC4GLS0), 3, b
#define LC4G1D3N                         BANKMASK(CLC4GLS0), 4, b
#define LC4G1D3T                         BANKMASK(CLC4GLS0), 5, b
#define LC4G1D4N                         BANKMASK(CLC4GLS0), 6, b
#define LC4G1D4T                         BANKMASK(CLC4GLS0), 7, b
#define LC4G1POL                         BANKMASK(CLC4POL), 0, b
#define LC4G2D1N                         BANKMASK(CLC4GLS1), 0, b
#define LC4G2D1T                         BANKMASK(CLC4GLS1), 1, b
#define LC4G2D2N                         BANKMASK(CLC4GLS1), 2, b
#define LC4G2D2T                         BANKMASK(CLC4GLS1), 3, b
#define LC4G2D3N                         BANKMASK(CLC4GLS1), 4, b
#define LC4G2D3T                         BANKMASK(CLC4GLS1), 5, b
#define LC4G2D4N                         BANKMASK(CLC4GLS1), 6, b
#define LC4G2D4T                         BANKMASK(CLC4GLS1), 7, b
#define LC4G2POL                         BANKMASK(CLC4POL), 1, b
#define LC4G3D1N                         BANKMASK(CLC4GLS2), 0, b
#define LC4G3D1T                         BANKMASK(CLC4GLS2), 1, b
#define LC4G3D2N                         BANKMASK(CLC4GLS2), 2, b
#define LC4G3D2T                         BANKMASK(CLC4GLS2), 3, b
#define LC4G3D3N                         BANKMASK(CLC4GLS2), 4, b
#define LC4G3D3T                         BANKMASK(CLC4GLS2), 5, b
#define LC4G3D4N                         BANKMASK(CLC4GLS2), 6, b
#define LC4G3D4T                         BANKMASK(CLC4GLS2), 7, b
#define LC4G3POL                         BANKMASK(CLC4POL), 2, b
#define LC4G4D1N                         BANKMASK(CLC4GLS3), 0, b
#define LC4G4D1T                         BANKMASK(CLC4GLS3), 1, b
#define LC4G4D2N                         BANKMASK(CLC4GLS3), 2, b
#define LC4G4D2T                         BANKMASK(CLC4GLS3), 3, b
#define LC4G4D3N                         BANKMASK(CLC4GLS3), 4, b
#define LC4G4D3T                         BANKMASK(CLC4GLS3), 5, b
#define LC4G4D4N                         BANKMASK(CLC4GLS3), 6, b
#define LC4G4D4T                         BANKMASK(CLC4GLS3), 7, b
#define LC4G4POL                         BANKMASK(CLC4POL), 3, b
#define LC4INTN                          BANKMASK(CLC4CON), 3, b
#define LC4INTP                          BANKMASK(CLC4CON), 4, b
#define LC4MODE0                         BANKMASK(CLC4CON), 0, b
#define LC4MODE1                         BANKMASK(CLC4CON), 1, b
#define LC4MODE2                         BANKMASK(CLC4CON), 2, b
#define LC4OUT                           BANKMASK(CLC4CON), 5, b
#define LC4POL                           BANKMASK(CLC4POL), 7, b
#define LC5D1S0                          BANKMASK(CLC5SEL0), 0, b
#define LC5D1S1                          BANKMASK(CLC5SEL0), 1, b
#define LC5D1S2                          BANKMASK(CLC5SEL0), 2, b
#define LC5D1S3                          BANKMASK(CLC5SEL0), 3, b
#define LC5D1S4                          BANKMASK(CLC5SEL0), 4, b
#define LC5D1S5                          BANKMASK(CLC5SEL0), 5, b
#define LC5D1S6                          BANKMASK(CLC5SEL0), 6, b
#define LC5D1S7                          BANKMASK(CLC5SEL0), 7, b
#define LC5D2S0                          BANKMASK(CLC5SEL1), 0, b
#define LC5D2S1                          BANKMASK(CLC5SEL1), 1, b
#define LC5D2S2                          BANKMASK(CLC5SEL1), 2, b
#define LC5D2S3                          BANKMASK(CLC5SEL1), 3, b
#define LC5D2S4                          BANKMASK(CLC5SEL1), 4, b
#define LC5D2S5                          BANKMASK(CLC5SEL1), 5, b
#define LC5D2S6                          BANKMASK(CLC5SEL1), 6, b
#define LC5D2S7                          BANKMASK(CLC5SEL1), 7, b
#define LC5D3S0                          BANKMASK(CLC5SEL2), 0, b
#define LC5D3S1                          BANKMASK(CLC5SEL2), 1, b
#define LC5D3S2                          BANKMASK(CLC5SEL2), 2, b
#define LC5D3S3                          BANKMASK(CLC5SEL2), 3, b
#define LC5D3S4                          BANKMASK(CLC5SEL2), 4, b
#define LC5D3S5                          BANKMASK(CLC5SEL2), 5, b
#define LC5D3S6                          BANKMASK(CLC5SEL2), 6, b
#define LC5D3S7                          BANKMASK(CLC5SEL2), 7, b
#define LC5D4S0                          BANKMASK(CLC5SEL3), 0, b
#define LC5D4S1                          BANKMASK(CLC5SEL3), 1, b
#define LC5D4S2                          BANKMASK(CLC5SEL3), 2, b
#define LC5D4S3                          BANKMASK(CLC5SEL3), 3, b
#define LC5D4S4                          BANKMASK(CLC5SEL3), 4, b
#define LC5D4S5                          BANKMASK(CLC5SEL3), 5, b
#define LC5D4S6                          BANKMASK(CLC5SEL3), 6, b
#define LC5D4S7                          BANKMASK(CLC5SEL3), 7, b
#define LC5EN                            BANKMASK(CLC5CON), 7, b
#define LC5G1D1N                         BANKMASK(CLC5GLS0), 0, b
#define LC5G1D1T                         BANKMASK(CLC5GLS0), 1, b
#define LC5G1D2N                         BANKMASK(CLC5GLS0), 2, b
#define LC5G1D2T                         BANKMASK(CLC5GLS0), 3, b
#define LC5G1D3N                         BANKMASK(CLC5GLS0), 4, b
#define LC5G1D3T                         BANKMASK(CLC5GLS0), 5, b
#define LC5G1D4N                         BANKMASK(CLC5GLS0), 6, b
#define LC5G1D4T                         BANKMASK(CLC5GLS0), 7, b
#define LC5G1POL                         BANKMASK(CLC5POL), 0, b
#define LC5G2D1N                         BANKMASK(CLC5GLS1), 0, b
#define LC5G2D1T                         BANKMASK(CLC5GLS1), 1, b
#define LC5G2D2N                         BANKMASK(CLC5GLS1), 2, b
#define LC5G2D2T                         BANKMASK(CLC5GLS1), 3, b
#define LC5G2D3N                         BANKMASK(CLC5GLS1), 4, b
#define LC5G2D3T                         BANKMASK(CLC5GLS1), 5, b
#define LC5G2D4N                         BANKMASK(CLC5GLS1), 6, b
#define LC5G2D4T                         BANKMASK(CLC5GLS1), 7, b
#define LC5G2POL                         BANKMASK(CLC5POL), 1, b
#define LC5G3D1N                         BANKMASK(CLC5GLS2), 0, b
#define LC5G3D1T                         BANKMASK(CLC5GLS2), 1, b
#define LC5G3D2N                         BANKMASK(CLC5GLS2), 2, b
#define LC5G3D2T                         BANKMASK(CLC5GLS2), 3, b
#define LC5G3D3N                         BANKMASK(CLC5GLS2), 4, b
#define LC5G3D3T                         BANKMASK(CLC5GLS2), 5, b
#define LC5G3D4N                         BANKMASK(CLC5GLS2), 6, b
#define LC5G3D4T                         BANKMASK(CLC5GLS2), 7, b
#define LC5G3POL                         BANKMASK(CLC5POL), 2, b
#define LC5G4D1N                         BANKMASK(CLC5GLS3), 0, b
#define LC5G4D1T                         BANKMASK(CLC5GLS3), 1, b
#define LC5G4D2N                         BANKMASK(CLC5GLS3), 2, b
#define LC5G4D2T                         BANKMASK(CLC5GLS3), 3, b
#define LC5G4D3N                         BANKMASK(CLC5GLS3), 4, b
#define LC5G4D3T                         BANKMASK(CLC5GLS3), 5, b
#define LC5G4D4N                         BANKMASK(CLC5GLS3), 6, b
#define LC5G4D4T                         BANKMASK(CLC5GLS3), 7, b
#define LC5G4POL                         BANKMASK(CLC5POL), 3, b
#define LC5INTN                          BANKMASK(CLC5CON), 3, b
#define LC5INTP                          BANKMASK(CLC5CON), 4, b
#define LC5MODE0                         BANKMASK(CLC5CON), 0, b
#define LC5MODE1                         BANKMASK(CLC5CON), 1, b
#define LC5MODE2                         BANKMASK(CLC5CON), 2, b
#define LC5OUT                           BANKMASK(CLC5CON), 5, b
#define LC5POL                           BANKMASK(CLC5POL), 7, b
#define LC6D1S0                          BANKMASK(CLC6SEL0), 0, b
#define LC6D1S1                          BANKMASK(CLC6SEL0), 1, b
#define LC6D1S2                          BANKMASK(CLC6SEL0), 2, b
#define LC6D1S3                          BANKMASK(CLC6SEL0), 3, b
#define LC6D1S4                          BANKMASK(CLC6SEL0), 4, b
#define LC6D1S5                          BANKMASK(CLC6SEL0), 5, b
#define LC6D1S6                          BANKMASK(CLC6SEL0), 6, b
#define LC6D1S7                          BANKMASK(CLC6SEL0), 7, b
#define LC6D2S0                          BANKMASK(CLC6SEL1), 0, b
#define LC6D2S1                          BANKMASK(CLC6SEL1), 1, b
#define LC6D2S2                          BANKMASK(CLC6SEL1), 2, b
#define LC6D2S3                          BANKMASK(CLC6SEL1), 3, b
#define LC6D2S4                          BANKMASK(CLC6SEL1), 4, b
#define LC6D2S5                          BANKMASK(CLC6SEL1), 5, b
#define LC6D2S6                          BANKMASK(CLC6SEL1), 6, b
#define LC6D2S7                          BANKMASK(CLC6SEL1), 7, b
#define LC6D3S0                          BANKMASK(CLC6SEL2), 0, b
#define LC6D3S1                          BANKMASK(CLC6SEL2), 1, b
#define LC6D3S2                          BANKMASK(CLC6SEL2), 2, b
#define LC6D3S3                          BANKMASK(CLC6SEL2), 3, b
#define LC6D3S4                          BANKMASK(CLC6SEL2), 4, b
#define LC6D3S5                          BANKMASK(CLC6SEL2), 5, b
#define LC6D3S6                          BANKMASK(CLC6SEL2), 6, b
#define LC6D3S7                          BANKMASK(CLC6SEL2), 7, b
#define LC6D4S0                          BANKMASK(CLC6SEL3), 0, b
#define LC6D4S1                          BANKMASK(CLC6SEL3), 1, b
#define LC6D4S2                          BANKMASK(CLC6SEL3), 2, b
#define LC6D4S3                          BANKMASK(CLC6SEL3), 3, b
#define LC6D4S4                          BANKMASK(CLC6SEL3), 4, b
#define LC6D4S5                          BANKMASK(CLC6SEL3), 5, b
#define LC6D4S6                          BANKMASK(CLC6SEL3), 6, b
#define LC6D4S7                          BANKMASK(CLC6SEL3), 7, b
#define LC6EN                            BANKMASK(CLC6CON), 7, b
#define LC6G1D1N                         BANKMASK(CLC6GLS0), 0, b
#define LC6G1D1T                         BANKMASK(CLC6GLS0), 1, b
#define LC6G1D2N                         BANKMASK(CLC6GLS0), 2, b
#define LC6G1D2T                         BANKMASK(CLC6GLS0), 3, b
#define LC6G1D3N                         BANKMASK(CLC6GLS0), 4, b
#define LC6G1D3T                         BANKMASK(CLC6GLS0), 5, b
#define LC6G1D4N                         BANKMASK(CLC6GLS0), 6, b
#define LC6G1D4T                         BANKMASK(CLC6GLS0), 7, b
#define LC6G1POL                         BANKMASK(CLC6POL), 0, b
#define LC6G2D1N                         BANKMASK(CLC6GLS1), 0, b
#define LC6G2D1T                         BANKMASK(CLC6GLS1), 1, b
#define LC6G2D2N                         BANKMASK(CLC6GLS1), 2, b
#define LC6G2D2T                         BANKMASK(CLC6GLS1), 3, b
#define LC6G2D3N                         BANKMASK(CLC6GLS1), 4, b
#define LC6G2D3T                         BANKMASK(CLC6GLS1), 5, b
#define LC6G2D4N                         BANKMASK(CLC6GLS1), 6, b
#define LC6G2D4T                         BANKMASK(CLC6GLS1), 7, b
#define LC6G2POL                         BANKMASK(CLC6POL), 1, b
#define LC6G3D1N                         BANKMASK(CLC6GLS2), 0, b
#define LC6G3D1T                         BANKMASK(CLC6GLS2), 1, b
#define LC6G3D2N                         BANKMASK(CLC6GLS2), 2, b
#define LC6G3D2T                         BANKMASK(CLC6GLS2), 3, b
#define LC6G3D3N                         BANKMASK(CLC6GLS2), 4, b
#define LC6G3D3T                         BANKMASK(CLC6GLS2), 5, b
#define LC6G3D4N                         BANKMASK(CLC6GLS2), 6, b
#define LC6G3D4T                         BANKMASK(CLC6GLS2), 7, b
#define LC6G3POL                         BANKMASK(CLC6POL), 2, b
#define LC6G4D1N                         BANKMASK(CLC6GLS3), 0, b
#define LC6G4D1T                         BANKMASK(CLC6GLS3), 1, b
#define LC6G4D2N                         BANKMASK(CLC6GLS3), 2, b
#define LC6G4D2T                         BANKMASK(CLC6GLS3), 3, b
#define LC6G4D3N                         BANKMASK(CLC6GLS3), 4, b
#define LC6G4D3T                         BANKMASK(CLC6GLS3), 5, b
#define LC6G4D4N                         BANKMASK(CLC6GLS3), 6, b
#define LC6G4D4T                         BANKMASK(CLC6GLS3), 7, b
#define LC6G4POL                         BANKMASK(CLC6POL), 3, b
#define LC6INTN                          BANKMASK(CLC6CON), 3, b
#define LC6INTP                          BANKMASK(CLC6CON), 4, b
